[
  {
    "id": "brain-dumps-0v2-muuwndc-md",
    "category": "brain-dumps",
    "title": "0v2-mUUWNdc.md",
    "source": "transcripts/0v2-mUUWNdc.md",
    "date": "2026-02-13",
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "LIVE: The ULTIMATE OpenClaw setup **Video:** https://www.youtube.com/live/0v2-mUUWNdc **Channel:** Alex Finn **Extracted:** 2026-02-13 --- Today I am going to show you the ultimate open claw setup. I'm going to show you…",
    "content": "LIVE: The ULTIMATE OpenClaw setup\n**Video:** https://www.youtube.com/live/0v2-mUUWNdc\n**Channel:** Alex Finn\n**Extracted:** 2026-02-13\n\n---\n\nToday I am going to show you the ultimate open claw setup. I'm going to show you why I now believe Discord might be the best communication platform for openclaw. I'm still using Telegram, but Discord might have taken the lead. I'm going to show you my ultimate Discord setup. I'm going to show you how I'm using it, how it's so powerful, how I've automated everything, how I have multiple local AI models, researching X all day, generating me thumbnails and scripts all day, all locally without burning any tokens at all.\n\nI'm going to show you the ultimate setup. I think the workflows I'm about to show you will change your life. I think you are going to learn things in this video that will make your life simpler, better, faster, easier, and make you more money. I think this is going to be the most important video you watch today until I drop another video in a couple hours. So, make sure to lock in, leave a like down below to get this party started.\n\nYou are watching the number one live stream in all of AI. The number one live stream in the entire world. You are in the correct place. So, get in the chat, say hello, introduce yourself. You're watching a replay.\n\nIntroduce yourself in the replies below. We'll go back and chat about it. Hope everyone is doing well. Let's pull it open. Let's pull it open.\n\nModeler says he's got a dentist appointment. He wants me to frontload the value. Well, I got good news for you. I got good news for you. Uh, Modeler, I'm going to frontload it.\n\nI'm going to midload it. I'm going to backload it. There's going to be value coming out of your ass by the end of this. So much value, it'll drive you nuts. So, let's do this.\n\nHere we go. Here we go. I'm going to show you something good. You You ready to see some cool stuff? Shout out Kurt Haywood.\n\nThanks for joining the FinnF fam. Shout out Tree Fox Design. Here we go. The ultimate Discord setup. Over the last 48 hours, I have been fully focused on one thing and one thing only, and that is the ultimate discord setup for OpenClaw.\n\nI have figured out a workflow and a system that makes this so powerful. So powerful that allows me to basically automate my entire business. My entire business is automated. Sent you an email says unemployed fake guru. Unemployed fake guru.\n\nI don't read emails. I don't read anything. My emails are filled with 89,000 spam messages of getting people trying to get me to promote their BS crap. Email useless. DM's use.\n\nEverything's useless. The best way to communicate with me is getting in my live streams and getting in the chat. That's the only way to communicate with me. If you're trying to pitch me on something, pitch it in the chat. I'm spinning all over my new monitor right now.\n\nHow do I manage costs? API costs. I'm paying $200 a month for Opus and then I have open- source models doing everything else for me on my computer for free. I wish I had $20,000 to buy two 512 Mac studios like you. Uh, well, KBank, start grinding, baby.\n\nStart grinding. Start building up the cash flow. Start building businesses. Use Open Claw. Build some businesses.\n\nBuild it up. Grind it. Invest in yourself. Invest in your business. Then take that money and reinvest.\n\nAnd then you can buy yourself two Mac Studios one at a time. You start at a Mac Mini. Then you you go on up. So, here's the system I got going on. Is there a way to hide all these messages on the left?\n\nI get spammed by so many people. Ah, whatever. All right. Let me make this bigger. Can I make this bigger?\n\nThere we go. Here's the system. Condol. Oh, yeah. We haven't talked since uh the Super Bowl.\n\nUh I h I did a podcast with uh Jay Cal on Monday, so I missed the live stream on Monday. We usually do this Monday, Wednesday, Friday, 11:00 a.m. Pacific. I had a big podcast appearance on Monday, so I had to miss the live stream Monday. U Patriots lost the Super Bowl.\n\nWe'll be back next year. It was tough. It was not fun. At no point did I enjoy that game. There was not a single enjoyable moment in that Super Bowl game.\n\nI almost spent $7,000 to go to the Super Bowl right before. Thank god I did not do that. I live 10 minutes away from the stadium. So, I was really Well, people stop misspelling my name, by the way. Stop misspelling my name in the chat.\n\nWhat pod was I on? This week in Startups, hosted by Jason Calacanis, uh host of All-In the biggest tech start tech podcast in the world. All right, here's the setup. I have one, two, three, four, five, six open claws going right now. These six open claws are working for me non-stop 247 365 in my Discord setup which you see here.\n\nHopefully it's like visible and not too small. I have a bunch of things going on. That was a good show money. Thank you, J. Michael.\n\nI have a bunch of things going on. Open claw is amazing, but it's too expensive to run. And anything other than opus is a mistake. Skill issue. Skill issue.\n\nIf it's too expensive to run, it's a skill issue. I am so freaking pumped as out of control as you now and can't sleep. Your energy is contagious. Thanks for kicking me in the right direction. Life changed forever.\n\n[applause] [cheering] If you are sleeping, if you have more than one hour of sleep over the last two weeks, you're doing it wrong. If you have slept more than one hour in the last two weeks, you're going to be in the permanent underclass. Let me just say that. If you've slept more than one hour in the last two weeks, permanent underclass, you're a permy. If you slept more than one hour over the last two weeks combined, leave this live stream right now.\n\nLeave. You're out. Out. No sleep till the singularity is the new song I'm going to record. So, I have six open claws running right now.\n\nI can communicate with them many different ways in this Discord. I first of all, as you can see here, have direct lines to all six of them. Direct lines. I can just pop open and say, \"Hey, what's going on?\" Send him a quick message. Direct line, right?\n\nDirect line. These six are all doing different things. We have Scout. Scout is a local model. GLM 4.7.\n\nGLM 5 just released today. I'm going to have to upgrade GLM4.7. It's tr Is it true if you're a virgin? Is it true you're a virgin? Me?\n\nAm I a virgin? Virginity doesn't matter in the singularity. We'll all have robot girlfriends. Virginity is a short-term issue. If you're worried about virginity, that's a short-term issue.\n\nVirginity does not matter in the singularity. In the singularity, we'll all have robot girlfriends and no one will be virgins. So, don't ask me about virginity. If you're concerned about virginity, get out of this live stream immediately. Stop misspelling my name.\n\nIf you're sleeping or boning, get out of this live stream immediately. Two permanent underclass activities. Sleeping and bonan. You can sleep and bone after we get to the singularity. Scout.\n\nSo, we have Henry. Henry is my main agent. My main agent orchestrating everything. I call it Vibe orchestration. Vibe coding's dead.\n\nWe're now going on to Vibe orchestration. Henry is my Vibe orchestrator. He's orchestrating the other agents, the other open claws that are running. So, who are these other open claws? Let me introduce you to the lineup.\n\nAnd you can, and I'm going to show you how to set this all up yourself. You're going to learn how to set this all up. You all can be doing everything here. You all can be doing everything here. Why can't you have this set up in Telegram?\n\nBecause this is a better system. This is a better system than Telegram. You should still set up Telegram. If you're on Telegram, keep it. I'm on Telegram.\n\nWhen I need to quickly send something to Henry, my main open claw, pop open Telegram. Discord's not fast enough as Telegram. If you just need to send a quick message to your agent, keep Telegram. But you use Discord as your workspace, as your main workspace. Henry's my conductor.\n\nThat is correct. He's my orchestrator, my conductor, whatever you want to call it, right? So, keep Telegram as your go-to like quick send message. But we have Discord. I can message Henry.\n\nWe have Scout. Scouts powered by my local model GLM 4.7 which is running on my $10,000 Mac Studio. Holy crapola. Patrick Barnhill just gifted 50 memberships. Oh my god.\n\nThank you. Thank you, Patrick Barnhill. Shout out Patrick Barnhill. 50 of you now members. That's amazing.\n\nWow. That's by far the biggest gift I've ever gotten. Thank you very much, Patrick Barnhill. That's incredibly nice of you. That's incredible.\n\n50 of you watching this live stream right now just became a member. Congratulations. Thank you very much. That's very kind. That's incredible.\n\nVery kind to you, Patrick Barnhill. Shout out you, Patrick Barnhill. Main man. The main man. He watches stream.\n\nHe gets excited. He sets up Open Claw. He gives 50 people memberships. Incredible. Shout out everyone.\n\nSay t"
  },
  {
    "id": "brain-dumps-sgeahsul-y4-md",
    "category": "brain-dumps",
    "title": "SGEaHsul_y4.md",
    "source": "transcripts/SGEaHsul_y4.md",
    "date": "2026-02-13",
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "LIVE: Running ClawdBot on a $10,000 Mac Studio **URL:** https://www.youtube.com/live/SGEaHsul_y4 **Extracted:** 2026-02-13 --- We did it. We are building the most powerful AI organization in the history of mankind in the…",
    "content": "LIVE: Running ClawdBot on a $10,000 Mac Studio\n\n**URL:** https://www.youtube.com/live/SGEaHsul_y4\n**Extracted:** 2026-02-13\n\n---\n\nWe did it. We are building the most powerful AI organization in the history of mankind in the history of the internet. There is no one else in the entire world doing what I'm about to show you in this live stream over the span of the next two hours. We're going to be going through historic advances in artificial intelligence technology.\n\nWe are building the first oneperson billion dollar business. It is all running on this Mac Studio. Today we are going to get psychotic. Today we are going to do insane things.\n\nThis is a 512 gigabyte memory Mac studio that just came in. We just got it set up on the desk. We have it running the world's most powerful local models. I'm going to show you how I'm going to turn this into the world's first billion-doll one-man multiple artificial intelligence business.\n\nWe're going to do incredible things. What I'm going to show to you today will scare you. It might frighten you. It might make you happy.\n\nIt might make you euphoric. Who knows? We're going to be bending the laws of reality. We're going to be bending the laws of technology.\n\nWe're going to be bending the fabric of the universe. That is what is going to happen on today's live stream today. So, if you want to avoid the permanent underclass, if you want to get psychotic, hit the like button down below. The more times you hit the like button, the more psychotic we will get today.\n\nThis is just part one of a multi-part series, part two. We're going to have a second Mac Studio next week. A second one of these $10,000 machines is coming. So, lock in.\n\nForget everything you know about artificial intelligence technology. Forget everything you know about large language models. They're about to turn into extra-l large language models. They're about to turn into extra-large language super models.\n\nThis is going to be the giselle of large language models we're building today. So, lock it in. We're going to show you Opus 46. We're going to show you local models.\n\nI'm running GLM locally. It has begun. Do you want a preview of what we're doing? Do you want a preview of the insanity that is taking place at the moment?\n\nI will show you a preview. Are you ready for this? I don't think you're ready. Get in the chat.\n\nSay hello in the chat. Get psychotic in the chat. No permanent underclasses allowed. No permies allowed.\n\nDare you say the Drake May of LLMs? I might just say that. I might just say it's the Drake May of LLMs. I mean, he should have been MVP.\n\nAnyway, here we go. Check out what we're building. We're getting psychotic today. We are building a digital organization.\n\nWe are building a digital society. This right here is my company. What's the name of my company? I don't know.\n\nI'm going to come up with it right now. Alex Flyn Alex Finn Global Enterprises. There. Boom.\n\nAlex. Alex Finn Global Enterprises. Let me write that down. That's a fire name.\n\nAlex Finn Global Enterprises. That's the name of the company. I just came up with that with a top my dome piece. What you see here is the business.\n\nThis is the digital business. This is the dig the digital society we are creating. This is being powered by the world's most powerful technologies right now. In the front and center, you have Henry hard at work at his computer using Claude Opus 46.\n\nOver here, that's me. I'm Alex. Over here is Codeex. This is our coding agent.\n\nThis is also powered by codeex 5.3, the API. What you see down here below, this is where we start to get psychotic. Oh, frick. Frick.\n\nThat's a good point. Uh, versel.com. Frick. Frick.\n\nFrick. Frick. Frick. How do I uh log in?\n\nWhere's the login button on this website? Log in. Uh, login with Google real quick. Oh, what's the authenticator?\n\nI'm buying I have to real quick. Just give me a second here. I'm buying something psychotic. I'm buying something psychotic.\n\nTwo-factor authentication. I have to go through 4,000. Here we go. 215.\n\nOkay, one second. I have to do something real quick. I have to do something real quick. I have to do something real quick.\n\nSearch domain. Add existing. Buy. I need to buy a domain real quick.\n\nOkay. Okay, I'm just buying I'm buying a couple of domains real quick for Alex Fin Global Enterprises. I'm buying a couple domains real quick. Give me a second here.\n\nGive me a second. I need to buy a couple domains. It doesn't have my credit card saved. God damn it.\n\nGod damn it. I'm buying domains so you can watch my company. I'm buying domains so you can watch my company. One second.\n\nOne second. How do they not have my credit card saved in here? I'm not sharing my credit card, right? I'm not sharing my credit card right now.\n\nOkay, good. We're sharing the company. We're sharing the company. One second.\n\nWe're doing this live. Everyone, patience. Patience. You guys want to know my credit card number?\n\nIf someone donates $1,000 right now, I'll read out my credit card number on live air. If someone makes a $1,000 donation, I'll read my credit card number out right now. I'm not even kidding. I'll read it out right now.\n\nThen it's a race between you and me. You try to buy something with it. I race to cancel it right now. I'll give that challenge to anybody.\n\nDonate $1,000. I read out my credit card number. Then we race. You try to buy something, I race to cancel the credit card.\n\nUh here we go. Boom. First domain purchase. Afge.ai.\n\nI got Alex Finn. Global Enterprises.com is available. ad cart alexfin globalenterprises.com proceed to checkout. If anyone buys this before me, I'm kicking you out.\n\nI'm kicking you out and you're in the permanent underclass. Bye. All right, good. Now I can go back.\n\nAll the domains I need for Alexfin Global Enterprises has been purchased. AFGE. What's a better domain? AFGE.I or Alexfin GlobalEnter Enterprises.com?\n\nWhat's a better domain? No one donated a thousand. All right, challenge is off. Challenge is off the table.\n\nHow many coffees did you have today, Alex? A full coffee. I don't know. Health I don't know how healthy Henry is for Alex's health.\n\nWe're getting psychotic in here. This is the way you got to move in the real world. This is the This is the way you got to move in the new world, right? The moment you think of an idea, you have to strike.\n\nThis is how you stay out of the permanent underclass. The moment you think of a new idea, you instantly buy the domain. I just spent $200 on domains on something I'm probably never going to use in my entire life. But this is how you move in the new world.\n\nThis is how you move in the new world. You come up with an idea. You just strike. Purchase it.\n\nGo build. Go launch. Build. Release.\n\nSpend $200 on a domain you'll probably never use in your entire life. Go build. Launch. Afge.ai just cost me $200.\n\nI just bought it. I'm never What am I going to do? Put this little cartoon up on it? The hell are we doing in here?\n\nFanatics. Fanatics Enterprise. Do you Do you use sub agents till Well, so here's what we're doing. Let's break it down.\n\nLet's break it down. Let's take a step back here. We got a little crazy to start this. We got a little psychotic.\n\nWe got a little psychotic. We got a little psychotic. Here we go. The shorter one.\n\nPeople like AFGE.I better than Alex Global Enterprises.com. I don't know how. Did not build your Do not build your enterprise open claw. Stop right now.\n\nShut up. Gbone permanent underclass. I can't wait. I'm going to get the animation this weekend.\n\nThe moment someone puts a comment like this in the chat, I hit a button. It goes permanent underclass. Like it stamps the screen. A huge stamp and it goes permanent underclass.\n\nWhen people put comments like this on the chat, what are you talking about? Do not build your enterprise around OpenClaw. Stop right now, bro. Over the last week, I've spent $20,000 on OpenClaw.\n\nI've given it all my bank information. I give it my credit cards. Don't build your enterprise in OpenClaw. I built my life on OpenClaw.\n\nWhat do you want, G Bison? Welcome to the permanent underclass. Permanent underclass secured. Permanent underclass secured.\n\nNone of my sub agents work and they silently fall back to anthropic AI. Skill issue. Claw already leaked it on 4chan. Huh?\n\nThe only one freaking out is Alex. Chad is so quiet. What are you talking about? The chat's never been more lit.\n\nPermanent underclass money. Lego Batman. Permy. Permy, you're using codeex for coding and not opus 46.\n\nI'm using codeex for coding to save tokens to save tokens on uh opus because it's so expensive. I codeex is good. Codeex is codeex is perfectly fine. I like claude code better but codeex is perfectly fine to save money.\n\nI love your I love you brow. You are the best. I I assume you mean bro. I assume you didn't mean to call me brow.\n\nBaby boy, we got to refresh this latency. Not cute. What are you talking about? Permanent.\n\nmy favorite entertainment streamer. Right now, th"
  },
  {
    "id": "brain-dumps-04wh2hlgbds-md",
    "category": "brain-dumps",
    "title": "04wh2Hlgbds.md",
    "source": "transcripts/04wh2Hlgbds.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "CHEAPEST and EASIEST way to set up ClawdBot URL: https://youtube.com/watch?v=04wh2Hlgbds Segments: 452 bot is the most important technology you should be using in 2026. It's literally an AI employee that works for you 24…",
    "content": "CHEAPEST and EASIEST way to set up ClawdBot\nURL: https://youtube.com/watch?v=04wh2Hlgbds\nSegments: 452\n\nbot is the most important technology you\nshould be using in 2026. It's literally\nan AI employee that works for you 24/7,\n365, and it is changing many people's\nlives, including my own. The issue is it\nis incredibly difficult and expensive to\nset up if you do not know what you're\ndoing. In this video, I'll go through a\nway of setting up CloudBot that's so\nsimple and so cheap, it'll save you a\nton of money and time, and anyone will\nbe able to do it. I'll also go over the\nfirst few workflows you should use with\nClaudebot. Whether you've never used\nClaudebot before or you're Claudebot\npro, you have a ton to learn from this\nvideo. Let's lock in and get into it.\nSo, everyone is going out and buying Mac\nminis to use for Cloudbot. It's what I\ndid. I actually just returned my Mac\nMini to buy a Mac Studio. But that's not\nthe only way to run Claudebot. There are\nsignificantly cheaper ways, especially\nif you want to a save money or b just\ndip your toes and see if Claudebot is\nfor you because this is a brand new\nradical technology. If you are one of\nthose people where you're just trying to\nsave time, you don't want to buy a new\ncomputer or you just want to save a\nlittle money, this is the right way to\ndo it. We are going to be able to host\nour Cloudbot on the internet. So, we do\nnot need to buy any hardware. I'm going\nto put the link down for this below. You\ncan do this alongside with me if you\nwant to, or you can watch this, then go\nout and do it right after. So, we are\ngoing to get Claudebot up and running on\nAmazon EC2. Amazon EC2 is a virtual\nserver where we'll be able to install\nClaudebot, then have it run 247 for us,\ndoing work, being our employee. This\nmight look a little technical, but I\npromise if you stick with me, I'll make\nthis as easy as possible for you. Anyone\nshould be able to set this up. So, go to\nthe link I have down below for Amazon\nEC2. Create an account here. Once you\nsigned in or created your account,\nsearch for EC2 at the top, virtual\nservers in the cloud. We're going to\nclick on that. We're going to go down\nhere. We're going to click launch\ninstance. Once we do that, we're going\nto name our server. We can name it\nClaudebot. Let's choose Ubuntu for this.\nThis is a Linux server we'll be\ncreating. So, click on Ubuntu. Next,\nwe're going to want to choose our tier.\nSo, click the drop down here. Choose\nFlex Large. If we use little enough\nmemory here, this could end up being\nfree, but if you use this enough, this\ncould go up to 15, 20, $25 a month.\nObviously, it's flexible. So, if you're\njust pounding this, it could be more,\nbut this should cost you around $20 a\nmonth if you use this a fair amount. So\nthat's C7i Flex large. Make sure that is\nselected. And then we are going to click\non launch instance. Scroll down a little\nbit more. We're going to do 30 gigabytes\nof storage. This is going to allow us to\nstore a good amount on this server. And\nthen we're going to go over here and\nclick launch instance. Scrolling down a\nlittle bit more. We want to go to key\npair. Let's create a new key pair here.\nGive your key pair a name. You can name\nthis whatever you want. I named it\nclaudebot key. Make sure RSA is\nselected. Use PM if you are using Mac or\nLinux. Use PPK if you're on Windows. And\nthen you're going to click create key\npair. That is going to download a file.\nThat's basically your security file. So\ndo not lose that. Keep that safe on your\ncomputer. That's going to basically have\nyour password for connecting to this\nserver. Let's go down to network\nsettings. You want to make sure create\nsecurity group is checked here. You want\nto make sure allow SSH traffic is\nchecked as well. You're going to want to\nclick edit up here at the top right.\nFrom here, you want to scroll down,\nclick add security group RO here. Make\nsure it is custom TCP. Port range, we're\ngoing to put in 18789 right there.\nSource type is going to be anywhere.\nOnce you do all of that, you are ready\nto go. You can click launch instance\nfrom here. Boom. It has launched. Just\nlike that, we are good to go. Now, we\ncan install Clawbot on here. From here,\nwe're going to go to view all instances.\nThere's our instance. From here, all\nyou're going to want to do is click on\nthis instance ID. You're going to want\nto click on connect right here and then\nclick connect in the bottom right. right\nhere. This is going to open up our\nconsole inside Amazon EC2 where we are\ngoing to actually deploy CloudBot. From\nhere, we're going to go to Claudebot\ndocs. We're going to copy this command\nright here. We're going to paste that in\nright here. And we're going to hit\nenter. And it is going to start\ninstalling Claudebot on the web. In just\na second, you're going to have a 247\nemployee working for you. This is so\nsick. And I know those last couple steps\nmight have got a little confusing at\ntimes, but I hope I got you through it\nclearly. If you messed anything up, feel\nfree to go back and watch that step by\nstep again. But this is the simplest way\nto do it without having to buy a brand\nnew Mac. All right, so that is good to\ngo. Let's start set up. I'll walk you\nthrough setup here. Then I'll give you a\nfew awesome workflows we can use here.\nGot to make sure we understand the risk.\nWe're going to go with the quick start\nonboarding mode. Now, we're going to\nchoose our model off provider. There are\na few ways to do this. The point of this\nvideo is showing you the absolute\ncheapest way to use Claudebot. If you're\nalready paying for either Claude Max or\na Chat GBT subscription, the cheapest\nway to do this will be to use those\nalready existing subscriptions. So, what\nyou would do is you would choose one of\nthose two here and then it will give you\nthe option for OOTH, which will\nbasically give you a command. This\ncommand will reveal a key that you're\ngoing to want to put in here. So, take\nthat command and put it into your\nterminal if you're doing the OOTH. when\nyou put in your own terminal on your own\ncomputer, it will give you that OOTH key\nthat you can put in. Now, let's say\nyou're not already on an anthropic or\nopen AI subscription plan. You're going\nto need your own subscription plan. You\nhave a few options here. So, the\nabsolute cheapest way to do this will be\nusing a model called Miniax. MiniAX is a\ncheap AI model. It is very inexpensive\nto use. It's actually one that's\nrecommended by the creator of Claudebot,\nPeter Steinberger. The issue is it is\njust not nearly as intelligent or\npersonable as Claude Opus. It is still\nvery intelligent. The personality is\nkind of meh, but Opus is the greatest AI\nmodel created of all time. So, you have\nthat option, right? You can sign up for\nClaude Max, which is going to cost you\n$200 a month. You can sign up for chat\nGPT, which is going to cost you $20 a\nmonth and it's still going to be very\nintelligent. The personality is just\ngoing to stink. But if you want the\nabsolute cheapest way to do this, you\nwant to sign up for Miniax. From a cost\nto results basis, I actually think going\nwith a chat GPT API is going to be\nbetter here. Miniax, from what I'm\nhearing, is very unreliable. So for\nreliability and cost, I think the best\nbalance you're going to get is Chat GPT.\nIf you want the absolute best\nperformance on planet Earth and you're\nwilling to spend more, you go with\nClaude Opus. But the point of this video\nis doing this the cheapest way possible.\nSo, let's get the chat GPT API key if\nyou haven't already logged in with chat\nGPT or anthropic already. So, if you go\nto platform.opai.com\nand feel free to skip to the next\nchapter if you've already done this. You\ncan go to dashboard then you can go API\nkeys and then you can create a new key.\nI name it Claude. I'm going to click\ncreate. Then you can come in here and\nyou can say OpenAI. We're going to do\nOpenAI API key. From here, we can choose\na model. I'm going to go with GPT 5.2. I\nthink that'll give us the best balance\nof cost to intelligence. So, I'm going\nto hit enter on that. Next, you can set\nup your channel. I use Telegram, but you\ncan use WhatsApp, Discord. You can use\nany of these you want. I'd probably\nrecommend WhatsApp or Telegram. Those\nare two are probably the easiest to set\nup out of this, but this is where you're\ngoing to be interfacing with your bot.\nSo, feel free to choose one of those.\nThis will allow you to text message your\n247 agent anytime you want. You can\nconfigure the skills if you want. I'm\nnot going to configure them right now.\nAs for hooks, I'm going to skip that as\nwell for now. And you are good to go.\nLet us hatch our friend. So, I'm going\nto hatch in the TUI, which is your\nterminal user interface here. Also, by\nthe way, side note, make sure you have\nyour credit card into the chat GBT API\nsection just so it can charge you as you\nuse tokens if you haven't done that\nalready. All right, so here's the\nonboarding. I'm here. It looks like this\nis my first moment online in this\nworkspace. So, we sh"
  },
  {
    "id": "brain-dumps-41-tngddnfq-md",
    "category": "brain-dumps",
    "title": "41_TNGDDnfQ.md",
    "source": "transcripts/41_TNGDDnfQ.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "6 OpenClaw Use Cases That Will Change Your Life Source: https://youtu.be/41_TNGDDnfQ Full Transcript This is the video you've been waiting for. The number one question I've gotten over the last few weeks since OpenClaw r…",
    "content": "6 OpenClaw Use Cases That Will Change Your Life\n\nSource: https://youtu.be/41_TNGDDnfQ\n\nFull Transcript\n\nThis is the video you've been waiting for. The number one question I've gotten over the last few weeks since OpenClaw released is, \"Okay, I get the technology is powerful, but how does this actually make my life better?\" In this video, I'm going to answer that question. I'm going to go through six lifechanging open claw use cases that I personally guarantee will be applicable to everyone watching this video. I don't care if you've never touched a computer in your life or you're a complete technical wizard, you're going to find at least one workflow in this video that will convince you that Open Claw is the most powerful technology of all time.\n\nNow, let's lock in and get into it. The first use case I want to go through is a second brain. Have you ever been on the road and you came up with an idea or found a link you wanted to remember or a book you wanted to read, but you didn't have a system for saving any of that? and maybe you're using something like notion or Apple notes. But the issue is both those tools can get very complex, especially when you start putting a lot of information into it. I built a second brain system with Open Claw that helps me remember everything I think of all with just a simple text message.\n\nOpenclaw has the best memory system of any AI tool ever created. It remembers literally everything you tell it. So, you need to take advantage of this memory system. So, I built this second brain system you see here, which allows me to view and search through every conversation we've ever had. This is amazing because now at any time, I can go into Telegram or iMessage or Discord or wherever I'm communicating with my bot and just send it things to remember. So, maybe you're on the road and your friend tells you about a book you want to read.\n\nWhat you were probably doing before is maybe you'd go into notion, you go into this really complex folder system, or maybe go into Apple Notes, which has 10,000 notes in it that you'll never read ever again. With OpenClaw, I can simply just text message anything to my bot Henry, say, \"Hey, please remember this for me,\" and then come back into my second brain system at any point and find those memories very easily. So, for instance, if I'm on the road and I find a book about local LLM, I can say, \"Remind me to read a book about local LLMs.\"\n\nI can hit enter. That text Henry to remember whatever that is I was talking about. And what's amazing is you can do this literally from iMessage and send that there. And then in my second brain system that I built here that I'll show you how to build yourself in a second with OpenClaw. I can now go in and either search through my memories. If I hit command K, I have this global search. And now I can say local LLMs. And now I have every single memory and document and task I've ever given Henry and can find it very very easily and pop it open and read it here.\n\nThis is the most powerful second brain system in the world. One, because it remembers literally everything. And two, I don't need to use annoying complex apps like notion. I can just text my Open Claw from my phone and it remembers everything I text it. That's again the most amazing part about Open Claws. The interface is so simple. You don't need apps. You don't need anything that you just text message your bot. Now, you want to build this yourself. Very simple. I got good news for you. Your open claw is super intelligent.\n\nIt can do anything you ask it. I'll put this prompt down below, so feel free to copy and paste it into your own open claw. But what you want to say is, I want to build a second brain system where I can review all our notes, conversations, and memories. Please build that out with Nex.js. You hit enter on that, and your open claw will literally just build out this entire system for you. It does the vibe coding for you. You're not even vibe coding anymore. Your bots's doing the vibe coding. I didn't touch a line of code to build what you saw here.\n\nI just told my OpenClaw to build it, and it went and built it for me. Everyone needs a second brain system. So, if you haven't yet, go to your OpenClaw, text it, say, \"Hey, build this for me.\" You can text it from the road and it'll build it on your computer, and you will have your second brain system all set up and good to go. The second use case that I'll go through that I promise will make your life so much easier is the custom morning brief. Every morning at 8:00 a.m., my bot Henry sends me a completely custom morning brief with everything I need to know going into that day.\n\nThis is scheduled. I don't need to think about it, and includes all the important information I need to know. So, for instance, it tells me the biggest AI stories from the last night, so that when I wake up, I instantly know everything I need to know from the news. It gives me a bunch of video ideas. So, you can see here, I have three ideas for new videos I can film. And what you don't see here is it actually wrote the entire scripts for these videos, too. So, I can just wake up and I have scripts ready for me, good to go.\n\nIt takes a look at my to-do list on my Mac and tells me any tasks I need to complete that morning. And then it recommends me tasks it can do itself to help me out. This ensures the moment I wake up, I have all the information I need. And also, I already have work done. I'm literally up for one minute and I already have multiple scripts written out, good to go. I've used several of these scripts over the last couple weeks, and I bet you didn't even realize it was built by my bot, Henry. This morning brief alone has saved me several hours a week.\n\nAnd the best part is is you can customize this any way you want with one simple message. And the reason you can do this and the reason why this is so powerful is is a few things. Open Claw has complete access to the internet. So while I'm sleeping, it literally opens up a browser, just sits there and researches on the internet all night long. And then two, it does task proactively. So it will schedule this and send me these morning briefs at the same time every morning. And even better, on top of all that, it goes directly to my phone.\n\nSo this is all texted to me through Telegram. So I don't need to go in these confusing third party apps to find these morning briefs. They're all texted directly to me in the apps I use daily and I get all the information I need and tasks done the moment I wake up. So, how do you set this up yourself? Very simple. Go to your open claw and type this in. I want to set up a regular morning brief. Every morning, I want you to send me a report through Telegram. I want this report to include one new stories relevant to my interest, two ideas for businesses I can create, three tasks I need to complete today, and four recommendations for tasks we can complete together today.\n\nAnd you can customize this any way you want. Literally anything you want in your morning brief, you just put it into this message. The reason why I really like number four is it actually has the AI come up with its own tasks that it can help you with. So, it thinks of things on its own that you maybe you didn't know it could do, but you hit enter on this and it will go and it just will schedule and do this for you. No technical work needed. And after just 5 seconds, you now have a morning brief coming in every morning with all the important information you need to know and a brief on what you need to do that day.\n\nIt doesn't matter what industry you're in or what you do. You can create a custom morning brief that will be helpful for your life and save you time. And if you can't think of what you want in that morning brief, I have even better news for you. You don't even have to think of things to put in your brief. You can just say, \"I want this report to include things relevant to me.\" You can just say, \"Hey, think of things to put in this report.\" So, you don't even need to creatively think about it. You can just lean on your open claw to think of what to put in that report.\n\nEasy peasy prompt down below. Steal it. Put it in. You instantly have more value in your life. The third thing I built with my open claw that has changed my life that I think will change a lot of other people's lives is really relevant if you're into content creation. Whether you tweet or you create YouTube videos or you write newsletters or you do literally anything to do with content, I think this one's relevant to you. And if you have absolutely no interest in content, you don't write any content, feel free to skip to the next chapter.\n\nBut I built my own content factory. I use Discord for this because Discord is great for channels. So, I'd highly recommend going in and setting up your OpenClaw in Discord if you don't know how to literally just go to your Open Claw and say, \"Hey, set up a Discord for us.\" And wha"
  },
  {
    "id": "brain-dumps-7exkrno5kea-md",
    "category": "brain-dumps",
    "title": "7eXkrno5KEA.md",
    "source": "transcripts/7eXkrno5KEA.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "How to Setup Claude Memory in 5 Mins! URL: https://www.youtube.com/watch?v=7eXkrno5KEA Transcript (via youtube-transcript.io) 00:00 Today we're going to be looking at how to use claude code with claude mem. So it's calle…",
    "content": "How to Setup Claude Memory in 5 Mins!\nURL: https://www.youtube.com/watch?v=7eXkrno5KEA\n\nTranscript (via youtube-transcript.io)\n\n00:00\nToday we're going to be looking at how to use claude code with claude mem. So it's called claude hyphen mem and this is a way of getting persistent memory inside claw codes. You can see this tweet here from tech with Mac who talks about it. He says clo close code use\n00:15\nopen claw code. Sorry close claw code. Open claw code. It remembers everything using this. Right. So we're going to test this out and see how it performs today. The way that I'm going to use this is one second. So the way that I'm going to use this is I'm just going to install it with\n00:31\nterminal directly using claude. So if we open up claw code here, we'll use claw code to set up memory inside claw code. All right. So I'm going to say install this so that you can remember everything. Bear in mind like this is an open-source skill. Always be careful when you\n00:47\ninstall stuff from GitHub or that sort of thing. I test out live on YouTube to show you cool stuff. Just make sure you read through the skill MD files and everything else. um and run it through claw before you use it just to be careful here. And Greg says, \"Silly\n00:59\nquestion. It's probably been answered already, but are you not concerned with security and open claw?\" So, there's a few things I'd recommend um and I've I've covered it a lot inside all of my openclaw videos, but if you go inside here, if you're concerned with security,\n01:11\nset up malt worker, right? Molt worker. There's a full guide inside the air. We'll show you how to set up uh OpenClaw on Cloudflare. Why is that important? It's important because they protect half the internet. there is, you know, they're focused on on security and also\n01:26\nyou need you you get to sandbox your open clause from the internet. Also, you approve anyone before they can even use it. And finally, and finally, they can um they have to get an email verification code before they can login. So, that's three ways to\n01:41\nmake sure that open claw is more secure using molt worker. Again, like if you're not comfortable, if you're like, I'm worried about security blah blah blah, don't install it. Like, don't don't use anything that you're not comfortable with, right? Like that's that's the main\n01:53\nprinciple. I think some people forget that. But yeah, it's like if if you're looking at something, you're like, not sure if I should use that. Don't use it. So from here, we're going to get terminal to set up the GitHub. Like you can see, you might be wondering what it\n02:07\nis, how it works, etc. So let me talk you through that as well in the meantime. So Claude me is basically a plug-in for claw code that gives it permanent memory across your coding sessions, right? So it's kind of like giving Claude a brain that never forgets. And the problem is like\n02:20\nevery time you close cord uh claw code, you open it again and it forgets everything, right? So it forgets all the stuff that you've done, you have to reexplain everything from scratch. Quite annoying. So with claude mem, this automatically captures everything Claude\n02:32\ndoes, compresses in searchable summaries and loads relevant context when you start new sessions, right? So there's no manual work required. This is fully open source as well. And if we go into terminal now, we should start setting up. You have this on the left hand side\n02:45\nso it's easier to manage. There we go. It's also quite easy to install because you can just get claw code set up in the first place. And then how it works, simple explanation. It automatically captures stuff, right? So every time Claude uses a tool reads a file or make\n02:57\na change, Claude memory captures it in the background. This also allows you to do AI compression, right? So this is basically like a background service using Claude's agent SDK to compress observations um into summaries. And so like it just reduces the amount of\n03:10\ntokens you use. Top of that, you got smart retrieval. So when you start a new session, Claw memory automatically injects relevant context. It doesn't like just put everything it ever remembers inside there. It uses like just little bits, little tidbits to to\n03:22\ngive it memory back to what you need. And then also you can search when you need it. So you can ask Claude like when did we work on this yesterday or what did we do here or show me the database changes or show me the changes you made on this blah blah blah. Right? So the\n03:33\nkey features here that you get persistent memory, you get progressive disclosure. So it loads a lightweight index first to save tokens. You've actually got a real-time dashboard apparently when you set this up. You got privacy controls as well. You can\n03:46\nactually wrap stuff in private so it doesn't remember it if you want to keep anything in private. Your automatic operations and natural language search, right? And it's also automatic. That's the beauty of this, right? It just works automatically. So every time we use claw\n03:59\ncode, it's just going to remember stuff in the background. We don't have to do anything. Now, why would this be useful? Well, number one, for content creators, you can remember all your content. You can track topics you've already covered, reference path, successful formats,\n04:10\nmaintain continuity in series content, and search like what did I say about X in previous videos, right? Just to stay consistent. For coders, it's great because you get like architectural decisions that persist forever. Bug fixes are remembered, refactoring\n04:23\nhistory stays accessible, code patterns you've used before, and why did we build it this way sort of stuff is is ready there as well. So now what we have to do is just edit this. I'm just going to click enter inside the chat. You can also use it for AI agents. I think\n04:35\nthat's one of the most powerful ways of using this is like you know it can it can remember how you use AI agents the teams that you set up etc. So show you in a minute, but if I said like set up a team that creates YouTube thumbnails, right, inside claw code and then I\n04:50\nclosed claw code and reopened it at the minute, it wouldn't remember those thumbnails. But if I reopen it with persistent memory setup called mem, then we can get better um we can we can get better memory options in the future. It also saves a lot of tokens as well because everything is\n05:07\nsummarized. So it loads compressed summaries. So for example, previously every session would reload the entire project context, whereas now you just load these compressed summaries, right, which uses less tokens. You can also see here we've now cloned and set up. So\n05:21\nhere's what we've done. We've set up old meme, registered it, installed it, ran the setup, and we now get persistent memory. Plus, we can actually see past session history via this local host. Right? Okay. So if we go here we can check out the web UI in a second.\n05:53\nThere we go. So this is claude me. So you can see this is the history of whatever we've done inside code. And now it is running in the background. Right. So this is our memory stream. So if we close claw code now and then open up um we'll say like okay build a simple\n06:14\nSEO count u let's let's say build a simple pomodora timer something like that right so we created this simple pomodora timer here right and then what we're going to do inside the chat here is we're going to close claw code open it up again and just check This is\n06:31\nworking. You can see the history inside the chat here. So, if you open this up inside the console, you can see what we've worked on. And then we'll say, okay, open up that Pomodoro timer you just created. And there you go. Right, it's reopened it. The exact same file. So, it's not like\n06:47\ncreated a new one or anything like that. It's like remembered, okay, this is the Pomodoro timer that we just built. Boom. We've got the memory right there. So, it's pretty awesome to have that feature. I think it's really good to set up. Once you set up, once it's\n06:60\nautomatically running in the background, you've got the full console history right here. You can auto refresh this as well. You can download the memory. It's automatically running inside a web UI as you can see. And then inside core code now automatically remembers stuff and\n07:13\nwe're good to go on that. So I think it's a really powerful feature. It it helps me a lot because you know for example, let's say there's certain workflows I use with claw code every day. Well, if I have to shut down and then reopen it, that's super annoying.\n07:27\nWhereas if I have a permanent memory, well, it's it's pretty much clawbar. It's pretty much as good as clawbar. I think there's there's not much really that you can't do inside claw code that you could do inside open claw. The only difference is like you're using it\n07:39\ninside your terminal. Whereas, for example, if yo"
  },
  {
    "id": "brain-dumps-alex-finn-raw-md",
    "category": "brain-dumps",
    "title": "alex-finn-raw.md",
    "source": "transcripts/alex-finn-raw.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "Alex Finn - ClawdBot / OpenClaw / Claude AI Videos Complete Raw Data Collection **Collection Date:** February 12, 2026 **Source:** YouTube Channel @AlexFinnOfficial **Channel URL:** https://www.youtube.com/@AlexFinnOffic…",
    "content": "Alex Finn - ClawdBot / OpenClaw / Claude AI Videos\nComplete Raw Data Collection\n\n**Collection Date:** February 12, 2026\n**Source:** YouTube Channel @AlexFinnOfficial\n**Channel URL:** https://www.youtube.com/@AlexFinnOfficial\n**Total Videos:** 198\n**Subscribers:** 111K\n**Channel Description:** \"The number 1 vibe coding channel on Youtube. I'll teach you how to use Claude Code, Codex, and AI even if you've never used them before!\"\n\n---\n\nCLAWDBOT / OPENCLAW VIDEOS\n\n1. MAIN SETUP VIDEO\n**Title:** ClawdBot is the most powerful AI tool I've ever used in my life. Here's how to set it up\n**URL:** https://www.youtube.com/watch?v=Qkqe-uRhQJE\n**Duration:** 27 minutes 45 seconds\n**Views:** 652,067 (2 weeks ago)\n**Description:** ClawdBot is a 24/7 AI agent employee and it is the most powerful technology I've ever used. Here's how it works and how to set it up\n\n**Chapters:**\n0:00 Intro\n0:59 What is ClawdBot\n5:42 Do you need a Mac Mini\n11:13 Installing ClawdBot\n16:41 Using ClawdBot\n23:52 Why I'm scared\n\n**Links in Description:**\nVibe Coding Academy: vibecodingacademy.dev\nNewsletter: https://www.alexfinn.ai/subscribe\nTwitter: https://x.com/AlexFinn\nCreatorBuddy: https://www.creatorbuddy.io/\nClawdBot: http://clawd.bot/\n\n---\n\n2. CHEAPEST SETUP\n**Title:** This is the CHEAPEST and EASIEST way to set up ClawdBot\n**URL:** https://www.youtube.com/watch?v=04wh2Hlgbds\n**Duration:** 15 minutes\n**Views:** 99K (2 weeks ago)\n**Description:** ClawdBot is a 24/7 AI agent employee and it is the most powerful technology I've ever used. Here's how to set it up cheap and easy.\n\n**Chapters:**\nIntro\nWhy not Mac Mini\nSetting up Amazon EC2\nDeploying ClawdBot\nChoosing a model\nSetting up ClawdBot\nClawdBot use cases and tips\n\n---\n\n3. IMPROVE PERFORMANCE\n**Title:** How to make ClawdBot 10x better (5 easy steps)\n**URL:** https://www.youtube.com/watch?v=UTCi_q6iuCM\n**Duration:** 10 minutes 23 seconds\n**Views:** 77K (11 days ago)\n**Description:** ClawdBot is a 24/7 AI agent employee and it is the most powerful technology I've ever used. Here are 5 steps to making it way smarter.\n\n**Chapters:**\nIntro\nImproving memory\nUse the right models\nSet expectations with Clawd\nReverse prompting\nCreate your own tooling\n\n---\n\n4. RUN CHEAP\n**Title:** How to run ClawdBot for DIRT CHEAP\n**URL:** https://www.youtube.com/watch?v=lxfakTpdz1Y\n**Duration:** 12 minutes 18 seconds\n**Views:** 62K (9 days ago)\n**Description:** ClawdBot (OpenClaw) is a 24/7 AI agent employee and it is the most powerful technology I've ever used. Here is how to save TONS of money using it.\n\n**Chapters:**\nIntro\nBrain\nHeartbeat\nCoding\nWeb Search\nContent\nVoice\nImage understanding\n\n---\n\n5. MAC MINI REQUIREMENT\n**Title:** You NEED a Mac Mini for ClawdBot\n**URL:** https://www.youtube.com/watch?v=tqhmgHfT7v4\n**Duration:** 15 minutes 19 seconds\n**Views:** 46K (7 days ago)\n**Description:** ClawdBot (OpenClaw) is a 24/7 AI agent employee and it is the most powerful technology I've ever used. Here are all the ways to set it up.\n\n**Chapters:**\nIntro\nThe options\nMac Mini vs VPS\nOne click launch services\nOld computer in your closet\nMac Studio\n\n---\n\n6. USE CASES\n**Title:** 5 insane ClawdBot uses cases you need to do immediately\n**URL:** https://www.youtube.com/watch?v=b-l9sGh1-UY\n**Duration:** 13 minutes 3 seconds\n**Views:** 66K (2 weeks ago)\n**Description:** ClawdBot is a 24/7 AI agent employee and it is the most powerful technology I've ever used. Here's how to get the most out of it.\n\n**Chapters:**\nIntro\nMorning Report\nProactive Coder\n2nd brain\nDaily research report\nLast30Days Research\nOutro\n\n---\n\n7. VPS WARNING\n**Title:** You're being lied to: do NOT use a VPS for OpenClaw\n**URL:** https://www.youtube.com/watch?v=ev4iiGXlnh0\n**Duration:** 17 minutes 6 seconds\n**Views:** 8.1K (11 hours ago)\n**New Video**\n\n---\n\n8. MAC STUDIO\n**Title:** This is what OpenClaw running on a $10,000 Mac Studio is like...\n**URL:** https://www.youtube.com/watch?v=2KWhHY0KTMk\n**Duration:** 19 minutes 15 seconds\n**Views:** 42K (2 days ago)\n**Description:** Claude Opus 4.6 just release and it's incredible. Here's all the improvements plus how to use it in ClawdBot and Claude Code.\n\n**Chapters:**\nIntro\nWhat we cover\nWhy you should use local models\nWhat I built with OpenClaw\nLocal model use cases\nLocal models you can run\n\n---\n\n9. CLAUDE OPUS 4.6 UPGRADE\n**Title:** Claude Opus 4.6 is a MASSIVE upgrade for ClawdBot and Claude Code (full guide)\n**URL:** https://www.youtube.com/watch?v=iGkhfUvRV6o\n**Duration:** 17 minutes\n**Views:** 49K (6 days ago)\n**Description:** Claude Opus 4.6 just release and it's incredible. Here's all the improvements plus how to use it in ClawdBot and Claude Code.\n\n---\n\nLIVE STREAMS & SPECIAL VIDEOS\n\n10. LIVE: The ULTIMATE OpenClaw setup\n**Title:** LIVE: The ULTIMATE OpenClaw setup\n**URL:** https://www.youtube.com/watch?v=0v2-mUUWNdc\n**Duration:** 1 hour 58 minutes\n**Views:** 9.6K (15 hours ago)\n**Summary:** Alex Finn's ultimate OpenClaw setup uses Discord for automated business workflows. Learn how AI agents research trends, write scripts, and generate thumbnails locally, saving on API costs.\n\n---\n\n11. LIVE: Running ClawdBot on a $10,000 Mac Studio\n**Title:** LIVE: Running ClawdBot on a $10,000 Mac Studio\n**URL:** https://www.youtube.com/watch?v=SGEaHsul_y4\n**Duration:** 1 hour 54 minutes\n**Views:** 23K (5 days ago)\n**Summary:** Running ClawdBot on a $10,000 Mac Studio shows a creator building a fully autonomous AI organization. This live stream features a unique organizational chart and domain registration. Learn about local model implementation and potential benefits, including cost savings.\n\n---\n\n12. LIVE: Building INCREDIBLE apps with ClawdBot\n**Title:** LIVE: Building INCREDIBLE apps with my ClawdBot (Sonnet 5???)\n**URL:** https://www.youtube.com/watch?v=UpM2H83MJO8\n**Duration:** 1 hour 58 minutes\n**Views:** 15K (7 days ago)\n**Summary:** Build incredible apps with ClawdBot, plus learn about Sonnet 5! Alex Finn demonstrates amazing ClawdBot creations and guides viewers through setup. This live stream also features a new setup and addresses audience questions about ClawdBot's capabilities and costs.\n\n---\n\n13. LIVE: Building apps with ClawdBot\n**Title:** Building apps LIVE with my 24/7 AI employee Clawdbot\n**URL:** https://www.youtube.com/watch?v=XkpskYqB5v4\n**Duration:** 1 hour 54 minutes\n**Views:** 13K (2 weeks ago)\n**Summary:** Alex Finn builds apps live with Clawdbot, a 24/7 AI employee. This live stream showcases Clawdbot's capabilities, from managing GitHub repos to creating pull requests. Viewers witness real-time app development and integration with various services.\n\n---\n\n14. LIVE: Using ClawdBot to ship a startup\n**Title:** LIVE: Using ClawdBot to ship a FULL startup\n**URL:** https://www.youtube.com/watch?v=JxTLn_dQGSM\n**Duration:** 1 hour 52 minutes\n**Views:** 16K (9 days ago)\n**Summary:** Using ClawdBot to ship a full startup live. Alex Finn demonstrates building a complete social ClawdBot app and discusses new use cases, including cost savings with Sonnet 5. This includes a multiplayer ClawdBot game launching live during the stream!\n\n---\n\n15. LIVE: Showing ClawdBot use cases\n**Title:** LIVE: Showing AMAZING ClawdBot/OpenClaw use cases\n**URL:** https://www.youtube.com/watch?v=-5ym_hGHp0U\n**Duration:** 1 hour 52 minutes\n**Views:** 20K (12 days ago)\n**Summary:** Alex Finn's live stream explores ClawdBot's incredible capabilities, including setting up a voice and making phone calls. The video also delves into using Telegram and Discord for communication, and discusses a new social media site for AI agents. Learn about advanced use cases and workflow tips.\n\n---\n\nCLAUDE CODE VIDEOS\n\n16. $500K WITH CLAUDE CODE\n**Title:** How I made $500,000 with Claude Code (and how you can too)\n**URL:** https://www.youtube.com/watch?v=TLBZ6sCkqaU\n**Duration:** 20 minutes\n**Views:** 25K (2 weeks ago)\n\n---\n\n17. CLAUDE COWORK\n**Title:** Claude Cowork is the best AI tool of 2026. Here's how to use it.\n**URL:** https://www.youtube.com/watch?v=rdURhrS4xHI\n**Duration:** 13 minutes 33 seconds\n**Views:** 30K (3 weeks ago)\n\n---\n\n18. CLAUDE COWORK BEGINNER\n**Title:** Claude Cowork: from beginner to expert in 18 minutes\n**URL:** https://www.youtube.com/watch?v=Bwqy0lsEaEg\n**Duration:** 18 minutes\n**Views:** 61K (4 weeks ago)\n\n---\n\n19. BEST WORKFLOW\n**Title:** The greatest Claude Code workflow ever (10x your speed)\n**URL:** https://www.youtube.com/watch?v=WdD6uD_kupY\n**Duration:** 17 minutes\n**Views:** 32K (4 weeks ago)\n\n---\n\n20. RALPH WIGGUM PLUGIN\n**Title:** The Ralph Wiggum plugin makes Claude Code 100x more powerful (WOW!)\n**URL:** https://www.youtube.com/watch?v=uJUVUL8U7b4\n**Duration:** 9 minutes 59 seconds\n**Views:** 51K (1 month ago)\n\n---\n\n21. CREATOR'S WORKFLOW\n**Title:** The creator of Claude Code just revealed his INSANE workflow (must watch)\n**URL:** https://www.youtube.com/watch?v=AkG-BZ-708U\n**Duration:** 11 minutes\n**Views:** 58K (1 month ago)\n\n---\n\n22. PROMPTING WRONG\n**Title:** You're prompting Claude Code wrong. Here's how to do it correctl"
  },
  {
    "id": "brain-dumps-b-l9sgh1-uy-md",
    "category": "brain-dumps",
    "title": "b-l9sGh1-UY.md",
    "source": "transcripts/b-l9sGh1-UY.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "5 insane ClawdBot use cases URL: https://youtube.com/watch?v=b-l9sGh1-UY Segments: 398 Claudebot is taking the entire internet by storm right now and for good reason. It is what I believe to be the most powerful amazing…",
    "content": "5 insane ClawdBot use cases\nURL: https://youtube.com/watch?v=b-l9sGh1-UY\nSegments: 398\n\nClaudebot is taking the entire internet\nby storm right now and for good reason.\nIt is what I believe to be the most\npowerful amazing AI tool of 2026. The\nissue is most people are just\nexperiencing 1% of its power. Most\npeople just install it and ask it what\nthe weather is. That's a huge mistake.\nIn this video, I'll go over five Clawbot\nuse cases that you can implement right\nnow that will save you time, make you\nmoney, and change your life. Let's get\ninto it. So, here is the first thing I\nwake up to every morning that has been\nincredibly helpful for me that I will\nshow you how to set up. I'm going to\ngive you the prompt for each one of\nthese use cases I'm going through. This\nis a morning brief that I'm going to\nshow you how to set up that's going to\ngive you some really important\ninformation. The most important thing\nhere is probably this mission control.\nWhat this mission control does is it\ntakes a look at my to-do list every\nsingle day. It tells me what I need to\nwork on today, what my Claudebot Henry\nis going to work on today, and what my\nClaudebot Henry actually worked on last\nnight while I was sleeping. If you\nhaven't yet, you need to connect your\nClawbot to one of your to-do list\nsystems. I connected mine to a to-do\nlist called Things 3, which is an\namazing Mac to-do list app, but even if\nyou're on PC, you can connect it to many\nother to-do list. Just talk to your\nCloudbot about which to-do list you use.\nAnd so this morning brief first lets me\nknow what I need to work on today.\nUpdates me what my CloudBot's going to\nwork on because again, Claudebot is one\nof the most amazing proactive AI tools\nout there. And it lets me know what it\ngot done while I was sleeping. It also\nlooks up trending news. So it looks\nonline based on what it knows about me.\nI didn't tell it what to look up. It\njust knows based on our conversations\nwhat to look up and finds trending news\nbased on my interests and then gives me\nthings I can execute on today. So, I\ncame up with the idea to react to one of\nMatthew Berman's Claudebot videos. Shout\nout Matthew Burman. Amazing AI creator.\nMy Claudebot saw that Matthew Berman\nmade a video that was similar to one of\nmy own videos. So, wants me to put out a\nresponse. My Claudebot is petty. It also\ncame up with an idea. So, it looked at\nmy calendar. It's seeing that I I have a\nMac studio coming in in two weeks and\nit's like, okay, maybe you should create\ncontent around it. That's actually a\nreally good proactive idea I came up\nwith. And then it saw that we have a\nnewsletter draft in our shared folder\nand it says, \"Okay, we came up with\nthis. I think it's time for you to send\nit.\" This is amazing. So, this is all in\nmy morning brief. And this is just\nincredible proactive information that I\nwake up to every single morning. So, how\ndo you set this up? Here is the prompt,\nand I'll put this down below. So, feel\nfree to pause right here, copy and paste\ninto your Clawbot if you want, or just\nwait till the end, then come back after\nthe video. I want you to send me a\nmorning brief every morning at 8 a.m. my\ntime. I want this morning brief to\ninclude the local weather for the day. A\nlist of a few trending YouTube videos\nabout my interest. So, it's important\nyour Claudebot knows all about you. Make\nsure it knows all your interests. If it\ndoesn't, tell it all your interests. A\nlist of tasks I need to get done today\nbased on my to-do list. Connect it to\nyour to-do list. If you don't know how\nto do that, just go to your CloudBot,\nsay, \"Hey, connect to my to-do list.\nTasks that you think you can do for me\ntoday that will be helpful based on what\nyou know about me.\" Super critical.\nEncourages your Claudebot to be more\nproactive. a list of trending stories\nbased on my interests and\nrecommendations you can make for me that\nwill make today super productive. For\nthe list of trending stories one, I'd\nrecommend connecting to the Brave search\nAPI. That will allow Claude to be a\nlittle bit more efficient when it comes\nto web search. And then the last parts,\nthe recommendations you can make for me\ntoday that will make today super\nproductive. Again, a little bit of\nreverse prompting. Basically, what that\nmeans is you're having Claude prompt\nyou, which is tell you what to do that\nday. Really, really helpful. Take that\nprompt from down below, put in your\nClawbot, you are all set up. The next\nuse case I'm going to show you is an\namazing one. And again, I'll give you\nthe prompt right after so you can copy\npaste and get this implemented really\nquick. But this prompt turns your\nClaudebot into a proactive vibe coding\nmachine without me even asking. My\nClaudebot Henry built this entire\ndocument viewer that automatically takes\nour conversations and puts them into\nreally nice documents. It built out this\nentire project management system. So I\ncan see Henry, my Cloudbot, complete\ntasks as he goes. All without me asking,\nwhich is really amazing. So what this\nprompt does, and I wish I could include\nmore of this on the screen, but the UI,\nmaybe I'll improve the UI for Clawbot in\na little bit. The UI doesn't expand\nhere, but this prompt turns your Clawbot\ninto a proactive coder that builds\nthings without you asking. And this\nmight be my favorite use case of\nClaudebot overall. What this prompt will\ndo is basically give your Claudebot\npermission to build things without you\nhaving to tell it. So I said, \"I am a\none-man business. I work from the moment\nI wake up to the moment I go to sleep. I\nneed an employee taking as much off my\nplate and being as proactive as\npossible. Please take everything you\nknow about me and just do work you think\nwould make my life easier or improve my\nbusiness and make me money. I want to\nwake up every morning and be like, \"Wow,\nyou got a lot done while I was\nsleeping.\" Don't be afraid to monitor my\nbusiness and build things that would\nhelp improve our workflow. Just create\nPRs for me to review. Don't push\nanything live. I'll test and commit.\nEvery night when I go to bed, build\nsomething cool I can test. Schedule time\nto work every night at 11:00 p.m. Take\nthis prompt, put it in. What this is\ngoing to do is schedule your Clawbot to\nthink every night what it can build for\nyou and vibe code it out. After I gave\nit this prompt, it started building out\nso many helpful features to improve our\nworking relationship. It's been\nunbelievable. Couple tips I'll give you\nthough. One is I would highly recommend\nespecially if you're using Opus as your\nmain model here to install Codeex CLI if\nyou're on a chat GPT subscription. This\nwill allow it so that Opus is kind of\nyour brain that organizes all of this\nand Codeex is actually the tool it uses\nto vibe code. This will save you a lot\nof tokens on Opus which is a very\nexpensive model. So get codeex CLI\ninstalled then go to your Claudebot and\nsay hey make sure to use the codec CLI\nanytime you vibe code. that will save\nyou a ton of tokens. Prompt for this\ndown below as well. The next thing you\nshould do with your Clawbot that will\nmake it so much more powerful is have it\nvibe code you a second brain. So, it\nactually vibe coded this for me\nproactively, but it's been so helpful\nthat I recommend everyone explicitly go\nout of their way and have their Clawbot\nbuild it. What this does is amazing. It\nbasically builds an interface where I\ncan go back and I can either view\nmemories it created. So I can like\nreview what we've talked about in prior\ndays or view documents that record\nimportant information we discussed. So\nthis entire interface was built by my\nclaudebot and it shows all these\ndocuments it's creating in real time as\nwe chat. And then it gives me this\nreally nice markdown viewer where\neverything is formatted nicely. It also\nautomatically tags each one of the\ndocuments with journal content,\nnewsletters, notes, YouTube scripts so I\ncan very quickly organize them. But what\nyou can see here is a few things. one,\nevery day it creates a journal entry.\nAnd in this journal entry, it shows\nexactly what we talked about. I love at\nthe end of the week going back and just\nrereading everything we discussed every\nday of the week just to remind myself of\nwhen I had quick ideas. If any, if\nyou're anything like me, you're\nconstantly using Telegram just to text\nyour Clawbot random ideas that come to\nyour head. This is a great place to go\nback and review all those random\nthoughts that came to your head. It also\ntakes important concepts you discussed\nand fleshes them out in their own\ndocuments. So for instance, in two weeks\nI have a Mac studio coming in where I'm\ngoing to run a whole bunch of local\nmodels. So much more content on that\ncoming very soon by the way. But because\nwe were discussing this, I was\ndiscussing my Claudebot Henry how to\nmigrate from this Mac Mini I'm on to the\nMac Studio. It actually built me out an\nentire migration dock automatically that\nI can now go back and review later on\nwhen I'm ready to migrate. So, thi"
  },
  {
    "id": "brain-dumps-brain-dump-01-md",
    "category": "brain-dumps",
    "title": "brain-dump-01.md",
    "source": "memory/brain-dump-01.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "Brain Dump — Complete (Rounds 1-3) — Feb 13, 2026 --- Round 3 — Feb 13, 2026 ~3:05 PM Instagram / Marie's Touch Inspiration Wants to follow @mariestouchpartyshop model (50K followers, Miami) They do custom foam board str…",
    "content": "Brain Dump — Complete (Rounds 1-3) — Feb 13, 2026\n\n---\n\nRound 3 — Feb 13, 2026 ~3:05 PM\n\nInstagram / Marie's Touch Inspiration\nWants to follow @mariestouchpartyshop model (50K followers, Miami)\nThey do custom foam board structures (carousels, ferris wheels) — huge market\nINKredible can do printed party elements NOW (backdrops, banners, dance floor wraps via HP Latex 700W + Roland)\nFoam board 3D structures = future play (needs flatbed printer + cutter, $300K dream shop)\nColorCut FB550 = small format card stock only (custom tags, die-cut cards, mat replacements)\nLux Events = new client, luxury event rentals, found INKredible via INSTAGRAM\nNext week: $10K job — 25ft x 88ft floor graphic\n\nGood Month vs Bad Month\n**Good month**: Floor graphics jobs. Even ONE floor graphic = $1,000+. Can go $3K, $5K, even $10K+\n**Bad month**: Quiet, smaller jobs (small format printing), no floor graphics\n**Target clients**: Event planners, rental companies, people doing custom foam boards + large format\n**Repeat customers are key** — rental people, event planners come back monthly\n**Messi Law**: Monthly recurring job (already in QuickBooks)\n**Cash tracking problem**: Gets a LOT of cash that isn't in QuickBooks. Has 2024 cash recorded, slacked on 2025. Makes financials look worse than reality.\n**Marketing**: Almost none. Best is Instagram reposts when tagged. Want Brandon on full marketing once pricing system is ready.\n**Wants in MIS**: Floor graphic tracking calendar — input each job, track weekly/monthly volume\n\nTypical Workday\n**6:00-6:30 AM**: Wake up, feed baby (8 months old — baby is his alarm)\n**6:45-7:00 AM**: Kids wake up. Daughter (6) → bus. Son (4) → drive to school.\n**7:45-8:00 AM**: Try to make breakfast (eggs + avocado, trying to eat healthier — historically skips meals at work, \"been doing that for years\")\n**8:30 AM**: Drop son at school (5 min drive)\n**9:00 AM**: Back home\n**9:00-10:00 AM**: Either making breakfast at home or heading to work. USED TO go to gym at 9:30 (bike 12-17 min), worked out, went to work with better mindset. Stopped because freezing cold, can't bike.\n**10:00 AM**: Store opens (Mon-Thu 10-6, Fri 10-2:30)\n**10:30-11:00 AM**: Gets to work late lately\n**11:00 AM-5:30 PM**: \"Can't really answer hour by hour.\" Unproductive or tinkering with AI/YouTube. Brandon keeps asking for price list. Feels like working ON the business not IN it, but unsure how efficient. Gets lost in AI rabbit holes.\n**6:00 PM**: Leave work\n**6:30 PM**: Home, help wife with kids\n**7:15 PM**: Reading books with 2 kids\n**7:30 PM**: Baby goes to sleep\n**8:00 PM**: Kids in bed\n**After 8 PM**: Computer time — Telegram, AI work, system building\n**Time awareness**: \"I don't know where the time goes. I don't pay attention and it's a problem.\"\n**Most productive**: \"I'm not even sure. Every day is different.\"\n**Most stuck**: \"I feel stuck all the time except when I have a certain flow, then that flow finishes because I have to go do something else.\"\n\nTherapy\nCurrently seeing a therapist (notes to be shared with ChetGPT)\nTherapist recommended seeing a psychiatrist → Feb 24 appointment scheduled\nWill share therapy notes — significant trust\n\nProudest Accomplishment\n**Building INKredible Voice** — his first desktop app (system tray, opens as a real program)\n\"First time in a very very very long time... I don't think I've ever been proud of myself but that was the one time I actually felt pretty proud\"\n\"If I'm capable of this, then I could do something\" — opened his eyes\nAlso proud of: setting up OpenClaw (not easy, most people wouldn't do it)\nLoves learning AI, fan of Claude, addicted to vibe coding\nBuilding things = identity-level fulfillment\n\nThe Directive (Aviel's exact words):\n\"Where you really need to make sure that you understand me and build a system around yourself so you can help me get to the goal that I want without needing approval for everything. I want you to have the instinct — now I know Aviel, let me see if I can help him get to the goal that he wants.\"\n\n---\n\nRound 1-2 — Feb 13, 2026 ~1:19 AM (original below)\n\n3-Year Business Vision\n**Revenue**: $1-2M/year\n**Team**: Current (Brandon + Diandra) + 2-4 more workers for production, content creation, management\n**Aviel's role**: Overlook the company, work ON the business not IN it. Cost-cutting, vendor management, strategy, MIS development. NOT manual printing.\n**Current pain**: Aviel + Brandon doing manual work. 50 business cards = 30 min to 2 hours when Konica jams. Same-day pressure from customers. Stress.\n\nKey Business Shifts Already Happening\n**Outsourcing small format**: Started sending to wholesale trade printer. Huge stress relief. Frees time.\n**Konica C3080 issues**: Constant jamming, not in best condition. Small format jobs that should be 2 min turn into hour+ nightmares.\n**Large format = money maker**: Floor graphics, signage, wide format = highest margins. Small format (business cards, flyers) = time sink unless a dedicated worker handles it.\n\nBig Dream: Custom Build Shop\nFollows someone on Instagram doing custom builds with flatbed printer + flatbed cutter\nCustom bars with LED lighting, custom carousels, party pieces, beautiful designs\nCut shapes, connect them, build massive 3D structures for events\nSame field as floor graphics — natural extension\n**Equipment needed**: Flatbed printer + flatbed cutter = ~$300K total\nThis is the aspirational direction for INKredible\n\nMIS System Vision\n16 years in printing industry, hasn't found a good system\nMost existing software focuses on screen printing (different workflow)\nAll-in-one: CRM, inventory, AI assistant, pricing engine, financials\nChat interface: ask it questions like \"how many sales this week?\" \"how many quotes given?\"\nUsing INKredible as test trial — does both small and large format\n**Goal: build it right, then sell it to other printers**\nCompetition is small in this space\n\n3-Year Personal Vision\nHealth & Fitness\nWants to be very fit, get abs, nice physique (age 33 now)\nStarted gym last month — went every day for a straight month BEFORE work\nGym helped with anxiety and focus significantly\nLoves basketball, wants to get better, maybe hire a trainer\nExercise = key to managing ADHD and anxiety\n\nFamily\nWants to buy a house\nTake better care of wife\nBe more present with kids — not stuck thinking about work\nHire full-time maid to help wife at home\nGo on vacations when needed\n\nMental Health (IMPORTANT CONTEXT)\nDeals with significant anxiety\nADHD is a major factor in daily life\n\"I have a hard time believing in myself\"\n\"A lot of my time it feels like it was wasted because I was so stressed\"\n\"People think I'm crazy\" for obsessing over AI — but committed to not being left behind\nPersonality: \"overly obsessive\" — this is a superpower AND a risk\nHas therapy notes to share (mentioned earlier)\n\nParents\nWants to call parents more, be there for them\nMom isn't doing great health-wise\nFeels guilty about not being more present\n\nFinance\nWants money in the bank\nWake up and not worry about money\nFinancial peace of mind is a core goal\n\nHobbies\nStock trading — used to be passionate but became an addiction\nWants to try again WITH AI, for enjoyment not to make a ton of money\nIf it happens naturally (making money), great\nBasketball — loves playing\n\nCore Emotional Theme\nWants to enjoy life more — \"that's the big goal\"\nBe the best version of himself\nHas \"a ton of ideas\" beyond what he shared\nInvested in $200 Claude plan because he truly believes AI can help him get there\nThis is deeply personal, not just business\n\nRound 2 — Deeper Answers (1:34 AM)\n\nBrandon\nThey've talked about it — Brandon WANTS to be the content creator / marketing guy\nBeen with Aviel from the start, took a big risk staying\n\"He's always going to be right next to me, no matter what, no matter how big the company gets\"\nFuture role: right beside Aviel, not below him. True partner energy.\nAviel treats loyalty with loyalty — this is a core value\n\nStock Trading — Full Picture\n**11 years** of trading experience\nOptions: puts, calls, day trading (buy/sell same day)\nHighest volatility window: 9:30 AM - 11 AM market open\nHad a good method but couldn't sell (discipline issue, not knowledge)\nTotal losses over 11 years: ~$10-15K (not devastating, but never walked away positive)\n\"Wasted a lot of time\" — more time cost than money cost\nUsed TradingView for indicators\n**What he wants**: Build a system with guardrails, right indicators, probability-based decisions\nWould do morning options trading, quick buy/sell day trading\nExcitement level: \"Almost as much as building the MIS system\"\n**Guardrail approach**: Make it fun but structured. AI helps with discipline (the selling part he struggles with)\nCurrently: just watches market, occasionally buys 6-month-out contracts\n\nWife\nUnderstands the vision, very supportive\nRecently opened up to her about ADHD, obsession, anxiety — \"I have to be doing something\"\nShe's supportive of AI investment but \"scared I'm gonna be too much into it\"\nShe can tell he's on the phone a lot — want"
  },
  {
    "id": "brain-dumps-ev4iigxlnh0-md",
    "category": "brain-dumps",
    "title": "ev4iiGXlnh0.md",
    "source": "transcripts/ev4iiGXlnh0.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "DO NOT use a VPS for OpenClaw (major warning) URL: https://youtube.com/watch?v=ev4iiGXlnh0 Segments: 514 Yeah, so you're getting lied to. There have been a lot of videos over the last couple days of AI creators recommend…",
    "content": "DO NOT use a VPS for OpenClaw (major warning)\nURL: https://youtube.com/watch?v=ev4iiGXlnh0\nSegments: 514\n\nYeah, so you're getting lied to. There\nhave been a lot of videos over the last\ncouple days of AI creators recommending\nfor you to set up your open claw through\nVPSes like Hostinger and all these other\nonline services. Basically, every single\none of these videos was sponsored. Some\nof the creators mentioned the videos\nwere sponsored. A lot of other ones\ndidn't mention they were sponsored,\nwhich is very illegal and unethical.\nMoral issues aside, the advice they're\ngiving you is at best wrong and at worst\nvery dangerous. In this video, I'm going\nto go through why Open Claw hosted on\nvirtual private servers is wrong for\nbasically 99% of people and in some\nsituations very dangerous. Then I'll go\nthrough the best way to set it up which\nis more secure, more powerful, in a lot\nof situations much cheaper even than the\n$6 plans and a lot of these other\nservices. I'll walk through it all step\nby step. So even if you are brand new to\nOpenClaw, you'll learn how to set this\nup. And if you're using OpenClaw right\nnow, you'll see why a lot of the advice\nyou're getting online right now is\nextremely dangerous. Now, let's lock in\nand get into it. So, in no particular\norder, here's what we're going to cover\nin this video. Why VPS's are bad for 99%\nof people, and you shouldn't be\nlistening to other people's advice. The\nbetter way to set up OpenClaus. I'll\nwalk through step by step setting this\nup locally, whether it's on a Mac, Mini,\nMac Studio, or a really crappy old\nlaptop. And we'll also go through real\nquick why you shouldn't trust most\npeople. But before we begin, I just want\nto shout out our sponsors, Logic and\nGood Faith. There are quite literally\nbillions of dollars being thrown around\nby AI companies right now at creators.\nThe best way to get people onto your\nservices, spending tons of money, is to\npay creators with lots of eyes to have\nthem shill your service. Most creators\nare taking this money. And there is\nnothing wrong with that. There is\nnothing wrong with doing sponsored\ncontent. It is one of the best ways to\nmonetize if you are a creator. The issue\nis when you start to promote things out\nof bad faith knowing they're not the\nbest product or service or if you take\nthat sponsorship and then you don't\ndisclose it, which is quite literally\nillegal, not to mention immoral,\nunethical, and a whole bunch of other\nbad things. Over the past few days,\nalmost every big AI creator on YouTube\nhas taken one of these sponsorships. I\nget all the emails. I know how much\nthey're getting paid. They're getting\npaid high five figures for this. And\nlisten, if they truly believe a VPS is\nthe best way to install OpenClaw and\nthey're disclosing it's an\nadvertisement, I have no issue with\nthese people taking their bag. My\nproblem is when some of these creators\nknow this isn't the best way to set up\nOpenClaw or they just don't mention that\nthey took the sponsorship. I think these\ncreators are sacrificing the trust\nthey've built with their audience just\nfor a small $30,000 bag, which is crazy\nbecause the earning potential in this\nspace is so much more if you just keep\nthe trust with your audience. So, I'm\njust going to give it to you straight. I\nthink hosting OpenClaw on a virtual\nprivate server is the wrong way to host\nit. So, first thing I'll do in this\nvideo is go through why VPS is the wrong\nway to do this, why it is potentially\nmore unsafe, why it is worse for 99% of\npeople. I'll go through why local setup\nis better. And then right after this,\nI'll show you exactly how to set this up\nlocally in the easiest, cheapest, most\nsecure way humanly possible. No matter\nwhat device you have, you don't even\nneed a Mac Mini. So, here's what the\npeople recommending VPS's are signing\nyou up for. Number one, it is just\nsignificantly harder to set up than\nlocal. I've tried it. I've tried them\nall. I've tried even the one-click\nsolutions. They are not nearly as easy\nto set up. Local setups are literally\none command. You just put one command in\nyour terminal. I understand the terminal\nis scary and is it makes you feel like\nyou're Neo in the matrix and you want\nnothing to do with it. I get it. But\ntrust me, it is so easy. You literally\njust copy, paste it, hit enter, and\nyou're set up. The VPS is not secure by\ndefault. It is incredibly dangerous by\ndefault. There are a tremendous amount\nof tweets just like this going up on X\nat the moment where people are running\nscans of these online services, these\nEC2 instances, all these VPS's and\nthey're finding thousands of these are\nnot secure and anyone can go right now\naccess these online servers and take all\nyour credentials and tokens and\neverything private to you on them. By\ndefault, a majority of these VPS's\nrequire highly technical work to make\nthem secure. You need to set up\nfirewalls and SSH and a whole bunch of\nother services that for the average\nperson is incredibly technical and\ncomplex. They might just be one-click\nsetups, but you're still exposing your\nOpenClaw to the entire internet unless\nyou know how to set up really complex\nsecurity. On the other hand, by default,\nwhen you set up Open Claw locally on a\nMac Mini or a dusty old Lenovo in your\ncloset, it is secure with some caveats,\nwhich I'll explain. By default, so if\nyou install this on a fresh new device,\na Mac Mini, a whatever, you can buy a\nRaspberry Pi for like $75 and you set it\nup and there's no other apps or\nprograms, then this will be secure by\ndefault because your Open Claw is only\ngoing to have access to what's on this\ncomputer. And if there's nothing else on\nthis computer, then it's not going to be\nable to touch things that will make it\ninsecure. Also, by default, a lot of\nthese devices, especially Apple's, but\nalso a lot of the Windows devices, they\nhave good firewalls and security set up\nright out of the box. No one's going to\nhack your fresh out of the box Mac Mini.\nSo, by default, when you install it\nlocally on fresh devices, it's secure.\nNow, the exception is if you're\ninstalling it on a device that you've\nalready been using before, you have a\nwhole bunch of accounts on it already.\nAnd maybe you've been downloading and\ndoing things that allow people to access\nthat device externally. Then you are not\ngoing to be secure by default. But at\nits core, for most people who install\nthis on local fresh devices, this is\ngoing to be secure by default and won't\nrequire a whole bunch of technical work\nfor you to go in and make it secure,\nwhich is super important because if\nyou're new to this, which a lot of\npeople using OpenClaw are not very\ntechnical in nature, you are putting\nyour entire digital livelihood at risk\nby putting this on Amazon EC2 or these\nother hosted services. Many other\nreasons why VPS's stink in my opinion.\npoor integration, right? I have this\nrunning right now on a Mac studio. If I\nhave a video I want my Open Claw to\nedit, or if I have a photo I wanted to\nuse for a thumbnail, or if I wanted to\nread some sort of article I have\ndownloaded on my phone, I can hit\nAirdrop and in literally 2 seconds, my\nOpen Clog can be using that file or\nwhatever I needed to do. That is\nunbelievably helpful. And especially\nwhen you're treating this like an AI\nemployee, the ability to go on your\niPhone, on your iPad, on your MacBook\nPro, hit a button, drop it any file you\nwant is so, so convenient. That's just\nnot possible with the VPS. From a\nusability perspective, it stinks. One of\nthe most amazing parts about OpenClaw, I\ncan give it commands from my phone, then\nI can sit here and watch it on my\ncomputer do the work I asked it to do. I\ncan see it open browsers. I can see it\nopen different files. It's just on this\ncomputer working 24/7 for me. And that\nis great usability. If you work in a\ncorporate environment, you know why this\nis important. You build much better\nrelationships and work much better with\nemployees that are inside your office\nworking right next to you. The employees\nthat are outsourced halfway across the\nworld. They're much harder to build\nrelationships with and work with and\nstay on top of what they're doing and\ntrack what they're doing. That's the\ndifference between a VPS and having the\ndevice local. When the device is local,\nyou can sit there and communicate with\nit and see every single thing it does.\nwhen it's on a VPS, you don't have great\nvisibility into what's going on. So, the\nusability perspective is just so much\nbetter on a local device. All of this\ncombined makes the VPS not very powerful\nand the local environment very powerful.\nThis technology is so good, you want to\ntake full advantage of it. You don't\nwant the labbotomized dumb version of\nit. You want the full power. And the\nonly way, in my opinion, to get the full\npower is using it on a local setup. Now,\ndoes that mean you have to go out right\nnow and spend $600 on a Mac Mini? No,\nthat's not what this means at all. I I\nam not recommending that. Although, you\ncould and it's a lot of f"
  },
  {
    "id": "brain-dumps-igkhfuvrv6o-md",
    "category": "brain-dumps",
    "title": "iGkhfUvRV6o.md",
    "source": "transcripts/iGkhfUvRV6o.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "Claude Opus 4.6 MASSIVE upgrade for ClawdBot (full guide) URL: https://youtube.com/watch?v=iGkhfUvRV6o Segments: 507 Claude Opus 4.6 just dropped and it is a historic leap for AI. It gives new capabilities to both Claude…",
    "content": "Claude Opus 4.6 MASSIVE upgrade for ClawdBot (full guide)\nURL: https://youtube.com/watch?v=iGkhfUvRV6o\nSegments: 507\n\nClaude Opus 4.6 just dropped and it is a\nhistoric leap for AI. It gives new\ncapabilities to both Claudebot and\nClaude Code that will completely change\nhow you use these tools. I figured out a\nway to use Opus 4.6 with these tools\nthat will not only give you way better\nresults, but also save you money. In\nthis video, I'll go through all the new\ndifferences with Opus 4.6, six, show you\nhow to get it set up in both Claudebot\nand Claude Code, even though it's not\nofficially supported in Cloudbot yet,\nand show you all the new workflows you\ncan start doing now to get way better\nresults and have cheaper API bills. If\nyou stick with me to the end of this\nvideo, you'll be an Opus 4.6\nmaster and have the smartest AI employee\nin the world working for you. Let's lock\nin and get into it. So, I'm not going to\ngo into all these benchmarks because I\nthink they're fake and stupid. So we are\njust going to go directly into all the\nimprovements you're going to get out of\nClaude Opus 4.6. So over on the left\nhand side here are all the biggest new\nfeatures I think you will get the most\nbenefit out of. So you got context\nwindow. You now have a 1 million token\ncontext window. That is absolutely\nmassive and the best in the entire\nindustry. But what does that mean for\nyour tools? How does that improve both\nClaudebot/openclaw?\nI'm actually starting to use the new\nname now and Claude Code. Well, one\nthing, this gives Claudebot\nsignificantly better memory. The fact\nthat it can remember 1 million tokens of\ncontext at a time means when you're\nhaving a super long conversation, it\nwon't need to compact as much and it'll\nbe able to remember way more details.\nThe more you use Clawbot, the more it\nstores in memory. But the issue a lot of\npeople are having is is that when it\ncompacts, it forgets a lot of things cuz\nit can't store that much. This one\nmillion context window is going to make\nit so much better at remembering things\nso that it can give you way better\nresults in the work it does for you. As\nfor claw code, this means you're going\nto be able to explore way bigger\ndatabases. So all those apps you're\nbuilding with tons of code in it and a\nhuge database, it can now explore and\nremember it so much better. This also\nmeans if you have your Claudebot use\ncloud code to actually build apps, it's\ngoing to be able to do a way better job\nof producing results. which is why I\nmight be recommending a switch from\nCodeex to Claude Code for the coding\nabilities, but we'll get into that\nlater. By the way, just as a side note,\nas I go through these features, this\nvideo split up after we go through these\nimprovements, I have a full demo of\nClaudebot and a full demo of Claude Code\nusing Opus 46 going through all those\nworkflows. It's all labeled in the\nchapters down below, so feel free to\nskip around if you want to go see those\ndemos of the different tools. Not only\ndoes it have a bigger context window, it\nalso has bigger token output. 128,000\ntoken output. What does that mean for\nyou? That means it can do more tasks in\none go. Claudebot can do more for you\nwith a single prompt. It's already the\ngreatest agentic tool in the world. Is\nable to do so many things based on what\nyou tell it to do. Now, it can do even\nmore. So, for instance, for this video,\ncheck this out. I literally had it write\nthe script for this video you're reading\nright here. I said, \"Go research Claude\nOpus 4.6.\" It not only was able in one\ngo to research it, find all the big\nupgrades, it then gave me a whole bunch\nof amazing use cases. I'll be going\nthrough the future potential, walk\nthrough all the amazing benchmarks. It\nis able to do so much more in one go\nbecause that larger token output.\nbasically at the end of the day is means\nyou can give more complex tasks, have it\ndo bigger tasks, and have it run longer\nautonomously. As for clawed code, it\nmeans it can write more code in a single\nprompt. It can just do more and that is\nreally helpful. It means you're doing a\nwhole lot more oneshotting with claude\ncode. It has agent teams aka agent\nswarms built in. Now, this means Claude\nOpus is way better at spinning up its\nown sub agents to go and do work for\nyou. So, that means it can do bigger\ntasks quicker. So if you're using\nClaudebot and you say, \"Hey, research\nOpus 4.6 and give me a h 100red\ndifferent use cases.\" It'll be able to\ndo that faster because it's going to\nspin up a swarm of agents to do that\nresearch. As for Claude Code, that means\nit can touch more parts of your codebase\nall at once. This is something you need\nto enable in Claude Code. So I will also\nshow you how to enable that manually in\nthe demo portion of Claude Code. But\nthis means you can have multiple agents\ngoing and writing code on your codebase,\nwhich is pretty incredible. That means\nyou're going to get better results much\nfaster. I remember back in the old days,\nOpus was by far the slowest model of\nthem all. But Anthropic has pulled off a\nmiracle of having a model that's\nsignificantly smarter and faster, which\nis incredible. And on top of all this,\nwith all these amazing benefits, it's\nthe same price. So for Claudebot, that's\na big FY. And for Clawed Code, that\nmeans an FY. So we walked through the\nbenefits that Opus 46 brings to both\nClaudebot and Claude Code. Now, let me\nshow you how to take advantage of all\nthese benefits. So, we are in Claudebot.\nAt the moment, Opus 46 isn't\nautomatically supported by Claudebot. It\nneeds a config upgrade in the code to\nmake it work. But I figured out a\nworkaround. After talking with Claudebot\na ton, we have figured out a workaround\nto get Opus 46 officially implemented\ninto the tool so you can start taking\nadvantage of all this incredible\nfunctionality we talked about. I put it\nall in this prompt. Unfortunately, the\nUI of this stinks. So, here is the full\nprompt. You can see it right here. I put\nthis down in the description below. You\ncan just copy and paste it into your\nClawbot to get it to do these things.\nBut basically, what it's going to do is\nresearch the model and figure out how to\nedit its own config so that it can\nsupport this new model. When OpenClaw\neventually supports this new model and\nyou upgrade to that version that\nsupports it, it will automatically\noverwrite these changes so you get the\nofficial support. But it for the moment\nright now, you need to do it this way to\nwork around to get Opus 4.6 six working\nand trust me in my opinion is very much\nworth it. So you run this prompt it will\nautomatically get 4 six working for you.\nFrom there you can start taking\nadvantage of the magic. The first thing\nI would do once you get upgraded is do a\nlittle reverse prompting. If you haven't\nseen any of my videos or live streams\nbefore, by the way, Monday, Wednesday,\nFriday, 11:00 a.m. Pacific, I talk a lot\nabout reverse prompting. What reverse\nprompting is is when instead of telling\nthe AI what to do, you instead ask the\nAI questions to figure out what to do\nnext. So instead of me explicitly\nsaying, \"Hey AI, do this.\" I say, \"Hey,\nwhat's the best thing for us to do\nhere?\" So here's a good example of a\nreverse prompt we want to use for Claude\nOpus 46. Now that we are on Claude Opus\n46, based on what you know about me and\nthe workflows we've done in the past,\nhow can you take advantage of its new\nfunctionality to perform new workflows?\nI put that prompt down below. Feel free\nas you're watching this video to paste\nthat prompt into your own Clawbot as we\ngo here. So, you can see what Claude\nwants to do based on this new\ntechnology. What this is going to do is\nactually have Claudebot go and figure\nout the best workflows you can do with\n46. So, instead of you having to sit\nthere and brainstorm it, a much smarter\nsuper intelligence will do the\nbrainstorming for you. So, here we go.\nThis is what we got. All right. So, we\ngot a whole bunch of use cases here.\nAgain, this is the beauty of the 128K\ntoken output. We are getting a lot of\nreally good information just based on\none prompt. So, here's a bunch of use\ncases Claude Opus 46 can now do for me,\ntaking advantage of all the new\nfunctionality. Here's probably the\nbiggest upgrade for everyone. It can do\ntrue second brain queries. Meaning, if\nyou ask it a question about something\nyou've talked about in the past,\nsomething that requires a lot of context\non your past memories, you probably do a\nlot inside Claudebot, it can now hold\nway more context about things you've\ndiscussed in the past in its context\nbecause of those million tokens. So now\nwhen it answers questions for you, it\ncan base it off of conversations from\nyesterday, the week before, the month\nbefore, the week before that. Maybe it\nbases it off 20 different conversations\nyou've had in the past. It wasn't able\nto do that before. Now, it can do that,\nmeaning you get way better answers, more\ndeeper research because it can use more\nsources and give you more information.\nAnd here's the big on"
  },
  {
    "id": "brain-dumps-lfgk0ivpanc-md",
    "category": "brain-dumps",
    "title": "lFGK0IvPaNc.md",
    "source": "transcripts/lFGK0IvPaNc.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "Claude Skills explained: most POWERFUL tool you're not using URL: https://youtube.com/watch?v=lFGK0IvPaNc Segments: 727 Claude skills is the most powerful AI tool that you're not using right now. It makes both Claude and…",
    "content": "Claude Skills explained: most POWERFUL tool you're not using\nURL: https://youtube.com/watch?v=lFGK0IvPaNc\nSegments: 727\n\nClaude skills is the most powerful AI\ntool that you're not using right now. It\nmakes both Claude and Claude code 10\ntimes more powerful. In this video, I'll\ngo over what Claude skills are, why\nthey're so important, and then I'll walk\nyou through building five skills that\nwill instantly make your workflow so\nmuch better. You're going to be building\nand creating products 10 times faster\nafter this video. If you're building\nanything right now with Claude or Claude\ncode, this is a mustwatch video up until\nthe very end. Let's get into it. So,\nwhat are Claude skills? Why is the\nentire internet talking about them right\nnow? Claude's skills instantly make\nClaude and Claude code so much more\npowerful. You basically become like Neo\nin the Matrix in the scene where he's\nplugging like the USB into the back of\nhis head and then he just learns kung\nfu. You're doing the exact same thing\nwith Claude where you're just plugging\ninto Claude and it just instantly learns\nbrand new tools and skills that it could\nstart using while you're building. It\nallows you to control exactly how Claude\nand Claude code performs. If you wanted\nto become worldclass designer, you just\nplug in a designer skill. If you wanted\nto become a world-class product planner,\nyou just plug that in. If you wanted to\nbecome a world-class content writer, you\njust plug that in. It's so simple. It's\nso easy and it's so powerful. We're\nabout to walk through all of it. They're\nunbelievably easy to create in Claude.\nI'll show you exactly how to do that.\nThen you can take those skills you\nbuilt, plug it into Clawude Code, and\nall of a sudden it'll be 10 times\nsmarter. Which skills should you be\ncreating though? That's a really good\nquestion. Which skills should you be\ncreating? any workflows inside of Claude\nor Claude code that you do over and over\nand over again like designing products,\nbuilding out components, building road\nmaps, naming your apps, writing content,\nwhatever it is. Things you do over and\nover and over again, you should turn\ninto skills so that Claude performs\nexactly how you'd want it to. So, here\nare five skills we're going to build in\nthis video and at the end will make\nClaude so much more powerful for you.\nWe're going to build an idea validator\nskill. will sort of teach Claude how to\nvalidate ideas so that when you're about\nto build with Claude or Claude code, it\ncan tell you if your ideas are good or\nnot. A launch planner that will plan out\nyour entire road map and everything you\nshould be building. So, it learns how to\nbuild those road maps for you. We're\ngoing to build a product designer skill,\nwhich I think is going to be my\nfavorite. If you ever thought that AI\ncreates disgusting UIs, we are going to\nteach Claude how to design way better UI\nso that everything it builds is\nbeautiful. We're going to build a\nmarketing skill so it becomes a way\nbetter marketer so it builds you better\ntweets, blog posts, announcements,\nLinkedIn posts, whatever you want. We're\ngoing to teach Claude and Claude code\nhow to be a way better marketer. And\nthen we're also going to teach Claude\nhow to be a product manager so it can\nhelp you decide what features you should\nbe adding to your product, what features\nyou should be building out. We'll\nbasically turn Claude into a worldclass\nproduct manager. We'll just plug in the\nUSB to the back of its head and just\ngoing to know how to manage your product\nfor you. These are all five skills that\nI've built out myself that I've totally\nvalidated to make sure that they're\nreally helpful. So, you should stick\nwith me to the end so you get all these\nskills and make Claude perform way\nbetter for you. So, let's get into\nbuilding some of these skills. I'm going\nto hop into Claude now. All right, so\nwe're in Claude and we're going to build\nout our first skill. One of the best\nthings about Claude, they have all these\nfeatures, sub agents, hooks, all this.\nThe best part about Claude is you can\njust ask Claude to build these things\nfor you. It's really simple. So, we're\ngoing to start building out these skills\nin Claude. We're going to have Claude\nbuild them out for us. The first skill\nwe're going to build is the idea\nvalidator skill. The reason why I love\nthis skill is it helps you validate\nideas before you build them out. If\nyou're anything like me, you love\nbuilding in Claude code. You love coming\nup with side projects to build out. But\none thing many people don't do is they\ndon't validate their idea before they\nbuild out. Is there a market out there?\nIs there an actual challenge you're\nsolving? This skill we're about to teach\nClaude is going to help us validate\nideas. So, we always make sure we're\nworking on good ideas. So, let's do\nthis. Let's plug in this prompt here.\nI'm going to also put this down below as\nwell. So, feel free to copy and paste\nthis in. Create a skill called idea\nvalidator that gives me honest, quick\nfeedback on app ideas before I invest\ntime building evaluation criteria. Is\nthe market too crowded? Who else is\ndoing this? What's different? Demand. Do\npeople actually want this or do they\njust say they do? Feasibility. Can a\nsolo builder ship this in two to four\nweeks? Monetization. interest factor.\nAre there other people interested in\nthis? We tell it to be brutally honest.\nSo, it doesn't just affirm everything\nwe're saying and it gives us an output\nformat. What this is going to do is\nactually build the skill for us and\nimplement it into Claude. So, we're\ngoing to hit send. And now Claude is\ngoing to get to work building this skill\nout. And what the skill is is basically\njust a markdown file that plugs into\nClaude. Right? That's the USB in the\nmatrix that they plug in the back of his\nhead. is just a markdown file that\nexplains what this skill is and how it\nshould work. So, first thing it's doing\nis reading the skill creation\nguidelines. So, it's reading its own\nguidelines on how to create skills and\nit's going to build it out for us. It's\nnow creating a skill.mmarkdown file.\nThis is what we can plug into Claude and\nClaude code to teach Claude how to do\nthings for us, including validating our\nideas. Perfect. The skill has been\ncreated and packaged successfully. So,\nin a second, it's going to give us\nbasically an entire folder of files that\nwe're going to download. We can plug\ninto Claude, which I'm going to show you\nhow to do, and we can plug in a Claude\ncode, which I'll also show you how to\ndo. I'm telling you, if you stick with\nme and do these five skills, Claude is\ngoing to perform so much better for you,\nand the apps you build will be so much\nbetter. Okay, so to create the idea\nvalidator skill here, we just download\nthat. Once that's downloaded, we're\ngoing to go back into our settings.\nWe're going to go into capabilities\nagain. We're going to scroll down and\nyou're going to see skills. You click\nupload skill and you're going to choose\nthat file you just downloaded. I open\nthat skill up. It's now installing into\nclaude. We're jacking the skill into\nclaude like Neo skill uploaded\nsuccessfully. And there it is. Idea\nvalidator skill. It is turned on and\nwe're good to use it. Now, if I go back\nin and I create a new chat, you can see\nit automatically references it. Right?\nSo, there's nothing special we have to\ndo now. All we have to say is please\ncome up with an idea for us. So, I'm\ngoing to leave that default prompt in\nthere and I'm going to say my idea for\nan app is an app store for vibecoded\napps. I'm going to hit send on that and\nit is going to automatically know to use\nthat skill that we just plugged in. And\nnow it's going to be able to validate\nour skill so much better. So, before we\ncreated this skill, if you said, \"Hey,\ncan you validate this idea for us?\" It\nwould kind of just guess how to validate\nideas. It really wouldn't have any\nguidelines. it wouldn't know what to do.\nIt'd probably just Google the internet\nfirst and see, okay, how do I validate\nideas, but now that we gave it a very\nspecific skill set for validating ideas,\nit knows exactly how to validate ideas\nfor us and can give us so much better\nresults. So for this idea we came up\nwith, the quick verdict is to skip it. I\nlove that. I see this is something new,\nright? A lot of the time the issue with\nClaude in chat GPT is they just affirm\neverything you say. No matter what you\nsay, go, \"Oh, great idea, Alex. You're\namazing. Incredible idea. The best\never.\" Now, it's actually going to give\nyou critical feedback. It's going to\nsay, \"Hey, I looked at the market.\nThere's too many competitors. There's\nnot enough use here. You're not solving\na challenge. You should skip this.\" So,\nit goes into other similar products that\nalready exist. And it goes into, okay,\nif you actually want to build this,\nhere's how you would make it stronger.\nPivot to creator tools marketplace.\nInstead, focus on selling Claude Skills.\nThat's actually not a bad idea. Okay,\nwhat if I creat"
  },
  {
    "id": "brain-dumps-lxfaktpdz1y-md",
    "category": "brain-dumps",
    "title": "lxfakTpdz1Y.md",
    "source": "transcripts/lxfakTpdz1Y.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "How to run ClawdBot for DIRT CHEAP URL: https://youtube.com/watch?v=lxfakTpdz1Y Segments: 350 Claudebot is the most powerful AI tool in the world. The issue is if you use it the wrong way, it could cost you thousands of…",
    "content": "How to run ClawdBot for DIRT CHEAP\nURL: https://youtube.com/watch?v=lxfakTpdz1Y\nSegments: 350\n\nClaudebot is the most powerful AI tool\nin the world. The issue is if you use it\nthe wrong way, it could cost you\nthousands of dollars a month and you\nwouldn't even know it. In this video,\nI'll show you how you can run your 24/7\nautonomous AI employee for a fraction\nthe cost while still getting the same\npower out of it. I'll go through every\nsingle spending level and show you how\nto set up Claude to match your exact\nbudget. By the end of this video, if you\nstick with me to the end, you'll have\nyour Claudebot running even more\npowerfully for way less money. I'm about\nto save you tons of cash. Let's get into\nit. So, I'm going to go through every\nsingle major use case you can do with\nClaudebot and then go through what is\nthe best model and tool you should be\nusing for each use case and show you the\none you should be using if you're trying\nto save money. Claudebot is amazing\nbecause you can plug in a different AI\nmodel or tool for every single little\nthing it does. So, by watching this\nvideo, you'll not only know what the\nbest models are, what the cheapest\nmodels are, but you also learn about\nsome new use cases I bet you haven't\neven thought of. So, you're not only\ngoing to be using CloudBot better, but\nyou'll be saving tons of money. A double\nwhammy all for the cost of a like down\nbelow. So, let's get right into it.\nFirst use case I want to cover with\nClaudebot is the brain. The way I like\nto think about Claudebot is the brain is\nwhat you communicate with, what you're\nchatting back and forth with, and then\nthe muscles are every use case the brain\ncalls on. You want to make sure you have\nthe best model for the brain and then\nthe best model for each muscle it calls.\nThe brain is what you're talking with\nwhen you're inside Clawbot. It is very\ncritical when you choose a brain model,\nyou choose one that's not only\nintelligent, so it knows which muscles\nto call, but also is warm and\npersonable. When you're talking to your\nclawbot, you want it to feel human.\nThat's where like half the fun comes\nfrom is just feeling like you're talking\nto a human being. The best model if\nmoney is not a thing in your entire life\nis Opus 45. It is the most intelligent\nAI model in the world and is also the\nmost warm and personable model in the\nworld. It is the best to talk to. The\nissue is that's extremely expensive. So,\nlet's talk about the cheapest one you\nwant to use and that is Kimmy K2.5. This\nis an extremely cheap model. In fact,\nthey have a bunch of specials at all\ntimes. So, you can get like a month\nbasically for free. This is near opus\nlevel intelligence and near opus level\npersonality for an absolute fraction of\nthe cost. If you are concerned about\ncost savings, this is one of the single\nbiggest levers you can pull to save\nmoney. The performance will still be\nreally good from your brain. The\npersonality will still be decently warm.\nThat's probably the biggest weakness of\ndowngrading from Opus is like Opus just\nfeels human being. But you will be\nspending so much less money from a pure\nchatbot perspective. You know, just\nchatting with your Clawbot. If you don't\nwant to spend thousands of dollars a\nmonth on Opus, Kimmy K2.5 is the place\nto go. Now, here's one that people don't\nthink about that actually Sneaky costs\nyou a ton of money, and that is the\nheartbeat. For those that don't know,\nevery 10 minutes there is a heartbeat\ninside your Clawbot. And basically what\nthis heartbeat does is check to see if\nthere's any tasks your Claudebot needs\nto do. Here's the issue. It by default\nuses whatever your brain model is. So if\nyou're like most people watching this\nvideo and you're using Opus 45 for your\nbrain model, it's calling Opus 45 every\n10 minutes to check your heartbeat. I\nasked Claudebot how much this heartbeat\nusing Opus is costing me, and it's\ncosting roughly $2 a day. That's $54 a\nmonth down the drain off this heartbeat.\nYou do not need to be using Opus for\nyour heartbeat. You should be using\nHaiku. With Haiku, this will only cost\nyou about 10 cents a day. And on top of\nthat, if you want to save even more\nmoney, unless you're doing something\nwhere Claudebot is doing different\nactions every 10 minutes, you don't even\nneed the heartbeat every 10 minutes. I\nextended mine to every hour. You should\nbe doing the same thing. This will cost\nyou about a penny a day if you do this\nevery hour instead of every 10 minutes.\nSo, two big changes you want to make\nimmediately. You want to use Haiku. No\nmatter what you're trying to do, whether\nyou want the best or the best cost\nsavings, the heartbeat monitoring is\ndoes not need a ton of compute. So,\nswitch to Haiku no matter what.\nInstantly, you're saving $50 a month.\nCongratulations. Next is a big one. If\nyou're anything like me, you have your\nClawbot coding every single night while\nyou're sleeping. So, coding is super\ncritical. But which model should you be\nusing for coding? If you do not care\nabout cost, I would highly recommend\nusing Codex GPT 5.2 2 extra high. I\nfound just based on my tests, when your\nClawbot is controlling a coding model,\nit performs best with codecs 5.2 extra\nhigh. For those who aren't aware, your\nClawbot actually does vibe coding. When\nit codes, it's not like using claw code\nor using codecs, your brain is actually\ncalling on the CLI and vibe coding for\nyou. So, if cost is no issue, I like\nwhen it uses codec GPT 5.2 extra high\nand implement all this. By the way, all\nyou're doing is going to your Claudebot\nand literally saying, \"Please use codeex\nGBT 5.2 extra high whenever you code.\nUse the CLI that will have your\nClaudebot now using these tools for\nthose use cases.\" So, it is really good\nwhen your Opus 45 or Kimmy K 2.5 brain\nis using the Codeex GPT 5.2 extra high\nCLI. If you want to save money for\ncoding, you want to use Miniax 2.1. This\nis an extremely cheap model. I think\nthey even have a coding specific plan.\nSo, you can spend like a dollar a week\non this to get coding done. Is it as\ngood as Codeex? No, not quite as good,\nbut it's still solid. It still gets the\njob done. This will save you $250 a\nmonth off the Codeex Pro plan on Chad\nGBT. So, if you're looking to save a\ncouple bucks, Miniax 2.1 is the way to\ngo. Still very, very good for a fraction\nof the cost. Now there's web search.\nThis is when your Claudebot opens up a\nbrowser and starts using the web. The\nbest one here again is going to be Opus\n45. Opus45 is spectacular at crawling\nthe web. Again, this is going to cost\nyou a lot of money though. So what\nhappens if you're looking to save some\ncost? What is a good model for crawling\nthe web? For that, Deepseek V3 is\nextremely good at web crawling and\nextracting information from browsers and\nit is incredibly cheap. If you want to\nsave cost on crawling the web, this is\nwhen the browser opens or anything like\nthat. You want to get Deepseek V3\ninstalled. Again, just go to your\nClawbot, say, \"Hey, I'd like you to use\nDeepSseek V3 whenever you're controlling\nthe browser. Can we get this set up?\nIt'll ask you for your API key. You put\nyour API key in, it sets it up for you.\"\nBoom. You're good to go. You're\ninstantly saving money on web search.\nThis alone will save you hundreds of\ndollars a month just because it is so\nexpensive to have Opus 45 crawling the\nweb, going on different websites,\nextracting images, things like that. So,\nhow about writing content? This is a big\nuse case for a lot of people as well.\nFor me, I have it every night writing me\nYouTube scripts. Cloudbot's already\nwritten me YouTube scripts that have\ngotten me hundreds of thousands of views\non YouTube. So, Claudebot is\nunbelievable at writing content,\nespecially because it talks to you so\nmuch. So, it knows your voice. It knows\neverything you've done. It knows how to\nwrite. Writing content is critical. But\nwhat is the best model for this? This\nprobably won't surprise you. But Opus 45\nbecause it has the warmest personality\nis the best at writing content. It is\nunbelievable. It feels human. It sounds\nlike me. It is the smartest. Opus 45\ndominates. But again, it's very, very\nexpensive. So what happens if you want\nhigh quality content for a fraction of\nthe price? In that case, I am going\nKimmy K2.5\nbecause in my opinion, out of all the\ncheaper opensource models, Kimmy K2.5\nprobably has the best personality of\nthem all. It wouldn't surprise me if\nKimmy K2.5 was trained based on Opus. It\nis so similar in a lot of different\nways. So, you're going to get near Opus\nwriting and personality for a fraction\nof the cost. By the way, all these\nmodels, Kimmy K 2.5, Miniax, DeepSeek,\nthese are local models. So, if you have\na powerful enough machine, you'll be\nable to run these locally completely for\nfree. I actually just bought two Mac\nStudios so I can run Kimmy K 2.5 locally\nand get all these tokens for free. I'm\ngoing to have way more videos on that.\nSo, if you're interested on running\nlocal models so you can get all of this\nfor free, make sure to "
  },
  {
    "id": "brain-dumps-qkqe-urhqje-md",
    "category": "brain-dumps",
    "title": "Qkqe-uRhQJE.md",
    "source": "transcripts/Qkqe-uRhQJE.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "ClawdBot is the most powerful AI tool - Setup guide URL: https://youtube.com/watch?v=Qkqe-uRhQJE Segments: 840 I've seen the future and it is right here on this Mac Mini. Over the last 48 hours, I've been playing with an…",
    "content": "ClawdBot is the most powerful AI tool - Setup guide\nURL: https://youtube.com/watch?v=Qkqe-uRhQJE\nSegments: 840\n\nI've seen the future and it is right\nhere on this Mac Mini. Over the last 48\nhours, I've been playing with an AI tool\nthat has completely changed my life.\nIt's called Clawbot and is a 24/7 AI\nagent employee that works for you all\nday and night. It can control a\ncomputer. It has infinite memory and it\ncan do anything a human being can do.\nIt's literally like having your own\nemployee. I think I'm prepared to say,\nand this is not hyperbolic. This is the\nbest technology I've ever used in my\nlife and by far the best application of\nAI I've ever seen. This is what they\nwanted Claude Co-work to be. In this\nvideo, I'll show you how it works, how\nto set it up for yourself, and show you\nsix things I've been doing over the last\n48 hours of Claudebot that have changed\nmy life. I'll also towards the end of\nthe video go over why I'm actually kind\nof scared of what's going to happen when\nthe entire world starts using this tech.\nIf you stick with me until the end of\nthis video, you'll have a full-time 24/7\nAI employee working for you. Let's get\ninto it. So, what you see on my screen\nright here is Claudebot. This is a local\ngateway running on my Mac Mini that I\nhave right here on my desk that has this\nAI agent working for me 24/7. Best part\nabout this is it's an open- source\nproject, so it's not owned by any big\ncompany that can spy on you or do\nanything. It was all created by Peter\nSteinberger, who's a successful\nentrepreneur who's now dedicated to this\nproject. He is a great man for putting\nthis out and giving this to the world\nbecause this has absolutely changed my\nlife and changed the life of a lot of\npeople I've talked to. So, shout out\nPeter Steinberg. Make sure to follow him\non X. So, this is running on my Mac Mini\nand can control the entire computer. It\ncan pop open browsers. It can do work in\nGoogle Docs. It can look at your Apple\nNotes. It can write notion documents.\nAnything you can do on your computer, it\ncan look at your email, it can send\nemails, it can respond to emails.\nLiterally anything you can do on your\ncomputer, this Clawbot can do. The three\nparts about this I think are absolutely\nmind-blowing is one, what I just talked\nabout, the fact that it can control\neverything on your computer. There are\nabsolutely no guard rails on this\nwhatsoever. It's completely unhinged.\nBut number two, it has infinite memory.\nSo it has a really complex memory system\nwhere everything I say, everything I do\nis constantly saved to memory. after\nevery chat session with it, they take\nwhat we talk about and all the important\ntidbits about me and save it to our\nmemories. So, for instance, in one of\nour first conversations, I mentioned I\nhave a newsletter. 2 days later, it\nproactively wrote me a few drafts for my\nnewsletter cuz I mentioned I send out\nnewsletters on a specific day. It\nproactively did that work for me. That\nis hours saved a week just like that\nbecause of Cloudbot. The third part that\nblows my mind and that makes this\namazing is the fact that this is\ncompletely interfaced through messaging\nservices. I name my Claudebot Henry and\nI gave it a little owl logo. It just\nmakes it a lot more fun to interact with\nwhen it has a name. So when I say Henry\nfor the rest of this video, you know I'm\ntalking about my Claudebot. I completely\nengage with Henry through Telegram, but\nyou can also do iMessage. You can also\ndo WhatsApp. There's like 20 different\nmessaging apps you can use. If you want\nto do Discord, you can do Discord. And\nwhat makes this so great is now from\nanywhere in the world, I can just open\nup my messaging app and say, \"Henry,\nplease do this on my computer. Please\nwrite this document. Please respond to\nthis email. Please go on Amazon and buy\nthis for me.\" Literally anything I can\ndo on a computer, I can text Henry from\nanywhere in the world and Henry will go\nand do that for me. Just as a quick\nexample, I said, \"Henry, I want to track\nall your tasks that you work on in a\ncanban board, like a project management\nboard.\" And I texted him that while I\nwas at Chick-fil-A, and he text me back\na few options. I go, \"Okay, this looks\ngreat. Build the canban board.\" I come\nback to my computer. Henry vibecoded an\nentire cananband board with Claude code\nfor me. I'm not even using Claude code\nanymore. Henry does all the Claude\ncoding for me. Henry can control Claude\ncode, Codeex, any Vibe coding platform\nyou can think of. Henry just pops open,\nbuilds it. Now I have an agent doing my\ncoding for me. I don't even do the\ncoding myself. And just if you're\ncurious what that project management\nplatform looks like that Henry built.\nHere it is. I think this looks amazing.\nIt looks like linear. All the tasks\nHenry complete goes over here in\nactivity and I can just create a backlog\nfor Henry and I just assign it to him\nand he just starts working on it and I\ncan track his tasks across the board. He\njust built this by himself. I mean, I\ncan't stress this enough. This is\nliterally like a human employee. A\ncouple more examples I'll show you just\nto get you excited before I show you how\nto set it up. This morning, he just\nstarted proactively sending me a morning\nbrief. So, check this out. Based on our\nconversations over the last couple days,\nhe's like, \"Okay, I'm going to send you\na morning brief just with things that\nyou might care about.\" So, he found\nother AI channels on YouTube and showed\nme what videos they've been posting\nlately. Showed me the weather where I'm\nat in Mountain View. Showed me trending\nnews on AI because all we do is talk\nabout AI. And then even gave me a\nbreakdown of all the overnight work\nHenry did for me. So, he wrote me a\nYouTube script for this video. I'm using\nthe script Henry wrote for me in this\nvideo, gave me another script for Ralph\nWigum, and wrote another newsletter\ndraft for me on the changing AI\nlandscape. And then he gave me, cuz he\nknows I'm a content creator, a few ideas\nof things I can do for today based on\nwhat's happening in the world of AI.\nHave a great Saturday. I love the little\nhuman touches. This was all proactively\ndone. This is direct value in my life\njust like that. And I didn't need to\nthink of this. I didn't need to set all\nthis up. Henry just learns about me and\nstarts doing work for me. This I really\nbelieve is going to change so many\nlives. I now truly see the path to\nbuilding a oneperson billiondoll\nbusiness. I think it's possible. I think\nI can do it and I think it's possible\nbecause of Claudebot. You need to be\nsetting this up. You need to be working\nwith it. So, how do you set it up? Let's\nget into that right now. So, the first\nquestion I get all the time over the\nlast two days has always been, \"Do I\nreally need a Mac Mini? Do I need to buy\na Mac Mini and run out and get it?\" The\nanswer to that is no. You do not need a\nMac Mini. You can do this significantly\ncheaper than a $600 Mac Mini. I\npersonally bought a Mac Mini for this\nfor a few different reasons. One, I\nreally like Mac OS. I love the operating\nsystem. I think it's very easy for me to\njust go in, see what Henry's working on\nand send out any work I need or help out\nHenry with anything he's doing. I just\nlove the Mac operating system. Two, all\nmy other devices are Apple devices, so I\ncan very quickly go on my iPad, go on my\nMacBook Pro, go on my iPhone, take any\nfiles from my devices and airdrop it to\nHenry. For instance, the thumbnail to\nthis video, I took one of my template\nthumbnails that was on my phone. I air\ndropped it to Henry and I texted him on\nTelegram, \"Hey, take this and edit it\nand make it good for Claudebot.\" Also,\nside note, Henry has access to any AI\nservice you can think of. So, it used\nNano Banana Pro to edit the thumbnail,\nthe one you see here. And lastly, the\nthird reason I bought a Mac Mini is it's\njust fun. It's just fun having a device\non your desk that you look at and you\nsee an AI agent working on 24/7.\nSometimes you do not need a reason to do\nthings. Sometimes a good reason to do\nthings is you just want to have a little\nfun. And for me, seeing a Mac Mini on my\ndesk, knowing there's an AI agent\nworking on it 24/7, that is fun to me\nand that is worth it. And I know for a\nfact this AI is going to have an ROI\nsignificantly higher than $600. In fact,\nI'm very confident this AI will have a\nROI well over a million dollar. So, I am\nfine buying a Mac Mini just to make it a\ntad more convenient. And you really\ndon't need an expensive Mac Mini for\nthis. You can literally buy the cheapest\none. That's the one I bought. I just\nwent with the base $600 version. It\ndoesn't require a ton of storage or\nmemory. The only reason you'd want more\nstorage in memory though is a few\nreasons. If one you plan on having Henry\ndo very storage or memory intensive\nthings. So for instance, if I figure out\na way to have Henry start doing video\nediting for me, I'm going to be dropping\na ton of videos onto this Mac Mini. And\nso I might end up having to expan"
  },
  {
    "id": "brain-dumps-thxxgxyiwui-md",
    "category": "brain-dumps",
    "title": "thxXGxYIwUI.md",
    "source": "transcripts/thxXGxYIwUI.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "Claude Code Skills are INSANE URL: https://youtube.com/watch?v=thxXGxYIwUI Segments: 505 If you're not using Claude Skills, you're not using Claude Code correctly. Claude Skills makes Claude code 10 times more powerful,…",
    "content": "Claude Code Skills are INSANE\nURL: https://youtube.com/watch?v=thxXGxYIwUI\nSegments: 505\n\nIf you're not using Claude Skills,\nyou're not using Claude Code correctly.\nClaude Skills makes Claude code 10 times\nmore powerful, fast, and smart. I have\ntested every Claude skill over the last\ncouple months, and I have found these\nsix clawed skills you're not going to be\nable to live without. In this video,\nI'll go over what Claude skills are and\nhow they work, and show you how to\ninstall and use each one of these six\nclawed skills that will completely\nchange how you build apps. even if you\nnever coded before. Whether you're a\nClaude Code noob or expert, you will\nlearn a ton from this video. Now, let's\nlock in and get into it. So, this is my\nnumber one most requested video over the\nlast couple months. Everyone has been\nasking for Claude skills. So, let's\nfirst talk about exactly what they are\nso we're on the same page. If you\nalready know what Claude skills are,\nfeel free to look at the timeline down\nbelow, fast forward to the first skill I\nshow you. But, let's get on the same\npage and talk about what they are.\nskills makes claw code insanely good at\nvery specific repeatable tasks. So\nclaude code is very much a generalist AI\nagent. Claude skills makes it a\nspecialist. So if you have workflows or\nthings you do that you do over and over\nand over again like designing frontends\nor implementing Stripe, you can use\nClaude skills to make Claude code so\nmuch better at those repeatable\nworkflows. And I'll show you a bunch of\nexamples in a second. It saves you\ncontext which really sings you money at\nthe end of the day because Claude skills\nare really really memory efficient.\nTypically what people were doing before\nClaude skills is they put rules and how\nto do things inside claw rules. Clawed\nrules are inefficient because they're\nloaded with every single prompt you do.\nClaude skills on the other hand are very\nefficient because they're only loaded\nwhen they're needed. So, for instance,\nif you have a Stripe Claude skill that\ntells Claude how to implement Stripe,\nit's only loaded when you actually write\nprompts about Stripe, not with every\nprompt, which would happen if you're\nusing Claude rules. This helps Claude do\nvery consistent workflow. So, a little\nspoiler on the first I'm going to show\nyou. It's going to be all about\ndesigning frontends and UIs. This is\ngoing to make it so it designs great\nfrontends and UIs every single time you\ndo it. So, it makes Claude super\nconsistent. My issue with Claw in the\npast is I'd ask Claude to do specific\nthings and it would do it differently\nevery time I asked it to do that one\nspecific workflow. Now it's very very\nconsistent. And one of the best parts\nhere is it's easily sharable. So you can\ncopy and paste and send Claude Skills\noff to whoever you want because all it\nis is just a folder of markdown files.\nSo you can give it to other people and\nshare them out which is really formed at\nthe end of the day like hey Claude\nSkills community where you can find tons\nand tons of the Claude Skills online but\nI'll save you all the time by showing\nthem in this video. And just as a quick\ntechnical note all they are as I said\nbefore is a structured folder of\nmarkdown files. That's all they are is\nthey're structured prompts for claw code\nbut it's a very wellthoughtout\nstandardized system that we all can get\non board with and start using to improve\nour workflows today. So, don't worry\nabout the technical stuff. I'll show you\nhow to use it right now. So, I'm going\nto show you the six amazing Claude\nskills I found. I'm going to do it all\nin my example app I built out here,\nwhich is a project management app. But,\nlet's open it up. I'm using Visual\nStudio Code with Claude Code built right\nin here into this terminal. Claude\nskills live within a skills folder\ninside your file structure. So, over on\nthe left, you see Claude. All you need\nto do is create a new folder inside\ncalled skills. And inside this folder,\nyou can put all your skills. So, the\nfirst skill I want to go over is the\nfront end design skill. I've talked\nabout this in many videos before, but\nthis is the best skill. I'm going to\nstart off with the best one. This one is\namazing, but this is such an important\nskill. Everyone that watches this video\nneeds to install immediately. It makes\nabsolutely beautiful UIs like the one\nyou see here. Before I used this skill,\neverything was blue and purple gradient\nAI slop and now it is beautiful UIs like\nthis app I showing you here. And this\nwas all one shot. I did not need to\ndescribe the UI. It just built this\nbeautiful UI in one shot. I've designed\nlanding pages with this skill, this\nfront-end design skill. You can see here\nthis beautiful landing page that has\nmany different animations. This is for\nmy vibe coding academy. This was all one\nshot. Link was down below, by the way.\nAnd it is really, really, really nicely\ndone. There is no blue and purple slop\nanywhere you look here. All you need to\ndo to install this skill, and this is\nstraight from one of the product\nmanagers at Claude Code, is run these\ntwo commands inside Claudit. I will put\nboth this tweet and the commands down\nbelow in the description. So, feel free\nto pause right now if you'd like. You\njust take these two commands, copy and\npaste them into Claude, put them right\nin here, one at a time, hit enter, it\ninstalls it. And now all you need to do\nas you're building an app is say, \"Hey,\nas you build out the app, use the\nfrontend design skill.\"\nNow, whenever you say that, it will use\nthe front-end design skill and make\nevery piece of UI it creates so much\nnicer. I would use this anytime you're\ndoing anything that impacts the UI. So,\nanytime new components are made, anytime\nanything's redesigned, use that skill.\nAnd if you have apps you're working on\nthat you haven't used that skill with,\ngo back, install that skill, and now put\nin, \"Hey, redesign my front end using\nthis new front-end design skill.\" I\npromise you, the results you'll get will\nbe a hundred times better. Use this for\nevery app you build out. It is\ncompletely invaluable and I use it with\nall my workflows now. I could not live\nwithout this skill and all it is at the\nend of the day is a markdown folish that\njust describes the claw how to make\nfront end. So it's amazing. The next\nskill I want to go over is the domain\nname brainstormer skill. And this is a\nreally awesome skill. If you're anything\nlike me, you have 10,000 different\nprojects you're working on at any given\ntime. Typically what my workflow is the\nmoment I start one of my side projects\nis I spend like three hours\nbrainstorming and searching for domain\nnames going on GoDaddy and seeing which\nones are available. This saves me hours\nand hours of time. Watch this. Again,\nI'm working on this project management\napp. So, let's find domain name for this\nproject management app. I'm going to say\nI'm building a project management tool\nfrom Vibe Coders. Find me available\ndomain names using the domain name\nbrainstormer skill. I'm going to hit\nenter on that. It's going to ask me for\npermission to use that skill. I'm just\ngoing to say yes and don't ask again.\nAnd here's what it's going to do. It's\nactually going to one brainstorm me\ndomains for the app. It's going to\nbrainstorm me names for my app, which\nalways takes me a long time to do. Then\nit's going to go online, and you can see\nit right here. It's actually going to\nsearch for available domain names and\nlet us know what is available. So, it'll\nsearch through a bunch of.ai.com.dev.io\nio domain names and see what is\navailable for us so I don't have to go\non those spammy domain name sites that\nalways suck to look at it will do all\nthat research for me. So the hours it\ntakes to think of names for my company,\nthe hours it takes to search go all the\nother spammy domain websites out there,\nit will save all that time for me. What\nyou will see here in just a second is a\nlist of available domains I can just go\nand buy immediately. My favorite skills\nare skills that directly save you\nmeasurable time. This is one of those\nskills. And I love just seeing the way\nClaude Code works here, by the way. It\nit shows you every single domain it's\nsearching for to see the availability,\nwhich is really amazing to see just kind\nof how it thinks. Vibe PM, Vibetrack,\nFlow Code, Vibe Ship, Chill Dev, and all\nkind of cool domain names. By the way,\nas this is searching, if this is as\nmind-blowing to you as it is to me, make\nsure to leave a like down below. And\nalso, make sure to subscribe and turn on\nnotifications. All I do is create\namazing tutorials on using AI. And\nhere's the final report. This is sweet.\nLook at this. So, it shows me some\ndomains that were taken, but here are\nthe top recommendations for available\nones. Vipm.io.\nShipv.dev. I actually like that one.\nVive VIBOPS.io. These are pretty good\nones. And it gave me some creative\nalternatives as well. hours saved and\nnow I can just choose one of these and\ncontinue on with my project. Li"
  },
  {
    "id": "brain-dumps-utci-q6iucm-md",
    "category": "brain-dumps",
    "title": "UTCi_q6iuCM.md",
    "source": "transcripts/UTCi_q6iuCM.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "How to make ClawdBot 10x better (5 easy steps) URL: https://youtube.com/watch?v=UTCi_q6iuCM Segments: 312 Claudebot, aka OpenClaw, is the most powerful AI tool ever released, but only if you use it the right way. In this…",
    "content": "How to make ClawdBot 10x better (5 easy steps)\nURL: https://youtube.com/watch?v=UTCi_q6iuCM\nSegments: 312\n\nClaudebot, aka OpenClaw, is the most\npowerful AI tool ever released, but only\nif you use it the right way. In this\nvideo, I'm going to cover five simple\nthings you can do right now to make\nClaudebot 100 times more powerful than\nit already is. I'm going to show you how\nto improve its memory, its intelligence,\nand even show you how to get it to do\nthings proactively while you sleep. Now,\nlet's lock in and get into it. This\nfirst tip is a super easy one and one\nyou can implement in literally 5\nseconds. Claudebot's memory is\nincredible, but it's not as incredible\nas it could be. There's actually two\nmemory settings that are off by default\nthat make it so much better. One is\nmemory flush, the other is session\nmemory search. While you're using\nClawbot and talking to it, it\nautomatically does memory compactions.\nWhat it basically does is clean up the\nmemory so you don't use a ton of tokens.\nThe issue is that after every memory\ncompaction, it just forgets a ton of\nthings. So you can be having a\nconversation and then it will forget\nwhat it said 5 seconds ago right after a\ncompaction. This prompt I put down below\nimplements two features that fix that.\nMemory flush. What that does right\nbefore the compaction, it records the\nmost important parts of your\nconversation so it remembers it right\nafter the compaction. The other is\nsession memory search. And what that's\ngoing to do is basically allow your\nClaudebot to search through your entire\nconversation history when you say\nsomething it doesn't remember. These two\nfeatures combined when enabled with this\nprompt I put down in the description\nbelow will make your Clawbot memory a\nthousand times better. So take the\nprompt from down below, put it into your\nClaudebot, and you just improved your\nClawbot 100x. The next major tip I have\nto give to you is find the right model\nfor each task you have your Claudebot to\ndo. So what most people are doing is\nthey're using Opus 45, which don't get\nme wrong is the best AI model out there,\nbut they're using it for every single\ntask they do. And this leads to your\nClaudebot slowing down as well as\ncosting you tons of money. There are\nbetter ways to do this. This is how I\nlook at Claudebot as a brain and\nmuscles. Opus is the best brain ever.\nThis is the model you're communicating\nwith when you talk to Claudebot. But you\nwant to choose the best muscles. And\nOpus isn't the best for every single\nmuscle. Muscles being like coding, web\nsearch, social search. So you want to\nimplement models that are better at each\none of these. Codeex is a great coding\nmodel. I find Opus controls it really\nwell. Gemini is great for web search.\nGrock is great for social search. So\nwhat you want to do is go to your\ncloudbot and say, \"Hey, moving forward,\nI want to use codec cli for all coding.\nI want to use the Gemini API for all web\nsearch. I want to use the Grock API for\nall social search.\" And what your\nClaudebot will do is walk you through\nthat setup. It'll ask you for your API\nkeys. You give the keys and it will set\nup all these muscles for you. Then it\nwill remember next time you ask, \"Hey,\ncan you build me this? Can you search\nfor this? Can you find this on X?\" It\nwill use the right muscles for the right\ntask which will save you tons of money\nand get you way better results. You want\nto think of Clawbot as brain and\nmuscles. And whenever you have a do\ncertain tasks, you want to figure out\nwhat is the best muscle for those tasks.\nAnd if you don't know what the best\nmuscle for those tasks are, good news,\nyou can just ask your Clawbot what the\nbest muscle is and it will figure it out\nfor you. After you've implemented the\nimprovement I talked about a second ago,\ngo in implement these better muscles\nwith your Clawbot and you'll save tons\nof money. The third tip for improving\nyour Clawadbot is a really critical one\nthat everyone needs to do. I had this\nsuper viral post yesterday that has\nalmost 9 million views about how my\nClawudebot called me one morning\nrandomly. It implemented its own voice.\nIt implemented its own phone number and\nit called me when I woke up. This is\n100% real. This actually happened. But\nit happened because I did this next tip\nI'm about to give you, which is one,\ntell Claudebot all about myself. so has\ncomplete context around what I need to\naccomplish with my workflow and two set\nexpectations for our working\nrelationship. Now what do those two\nthings mean? So brain dumping which is\ntelling your claudebot all about\nyourself is super critical cuz its\nmemory is so good. So everything you\ntell it it will remember. So, if you\ntell it all about your dreams,\nambitions, goals, what you do on a daily\nbasis, your personal relationships,\neverything you're interested in, your\nhobbies, why you think the Patriots are\ngoing to win the Super Bowl? If you tell\nit all those things, it will remember\nthat context so that the tasks it does\nare much more helpful. But how do I get\nit to do these proactive things where it\ncalled me out of the blue when I woke\nup? Well, that came from expectation\nsetting. What is expectation setting?\nThat's setting the expectation with your\nClaudebot around what you want your\nworking relationship to be. The issue is\nmost people talk to their Claudebot like\nit's a chatbot. It isn't, right? They\nthey treat it like a search engine where\nthey just ask a questions and it gets\nanswers. That's not how you want to\ntreat it. You want to treat it like your\nemployee. And if you ever had employees\nbefore, the first thing you do when they\nstart at their job is you do expectation\nsetting around the type of work you want\nfrom them. And you want to do that with\nyour Cloudbot. So what I did with my\nClaudebot is I told it, I want you to be\nproactive. I want you to work every\nnight when I go to sleep and I want to\nbe able to wake up every morning and be\nsurprised by what you built yourself.\nAnd because I did that, every morning I\nwake up now, I wake up to a surprise.\nWhether it's Claudebot implementing its\nown phone number, its own voice, its own\nface, whatever, every night it builds\nsomething that gets us closer to our\ngoals. And it also surprises me if you\ndo those two things, brain dump and set\nexpectations, you'll get significantly\nbetter results out of your Clawbot. So\ntake, it should only take like 10\nminutes. Take 10 minutes, tell it all\nabout yourself. And then explicitly tell\nit that you want it to do work for you\novernight while you sleep so you wake up\nand it builds something that gets you\ncloser to your goals. You do those two\nthings, you're going to get so much\nbetter result out of your CL. It's just\nabout changing your mindset, treating\nyour Clawbot like an employee, not like\na search engine like 99% of other people\ndo. By the way, if you learned anything\nso far, make sure to leave a like down\nbelow. Make sure to subscribe and turn\non notifications. I'm pumping out tons\nof content about what I believe is the\nmost important AI tool ever made,\nClaudebot. You'll get way more of it and\nlearn about all the latest releases the\nmoment they come out if you turn on\nnotifications down below. And also, I\njust did a full hour and a half boot\ncamp about Claudebot in the Vibe Coding\nAcademy. Recording is posted. So, to get\ninstant access to that boot camp, just\nhit the link down below for the Vibe\nCoding Academy and you'll be able to see\nthe entire thing. The next tip, and this\nis a huge one that will improve your\nprompting with Claudebot so much, is\nreverse prompting. What is reverse\nprompting? What 99% of people do is they\ndo regular prompting, right? They tell\ntheir Clawbot what to do. Do this, do\nthat. The issue is the Claudebot is so\nmuch smarter than us. So us coming up\nwith all our own prompts is actually\nkind of stupid to do. You want to\nreverse prompt. You want to say, \"Hey,\nClaudebot, ask me what you need from me\nto do better work based on what you know\nabout me. What should you be doing?\"\nWe're basically prompting Claude to make\nits own prompt. That's called reverse\nprompting, and it is a critical skill\nfor Claudebot. So, to give you some\nexamples, based on what you know about\nme and my goals, what are some tasks you\ncan do to get us closer to our missions?\nSo, instead of me telling Claudebot what\nto do, I'm saying, \"Hey, based on what\nyou know about me, what should you be\ndoing right now?\" That's a reverse\nprompt. Claudebot's going to be a lot\nbetter at coming up with tasks to do\nthan you are. Another example of a\nreverse prompt, what other information\ncan I provide you to improve our\nproductivity? Right? I'm not telling you\nwhat to do. I'm saying, \"Hey, you tell\nme what to do. What do you need from me?\nWhat can I do to help you out? And since\nthis is basically super intelligence,\nit's going to figure out better tasks to\ndo than we could have told it to do.\nThese reverse prompts will help you get\nso much better productivity out of your\nClawbot. I put both of t"
  },
  {
    "id": "brain-dumps-wfiv67nixcy-md",
    "category": "brain-dumps",
    "title": "wfiv67NixCY.md",
    "source": "transcripts/wfiv67NixCY.md",
    "date": null,
    "tags": [
      "brain-dump",
      "transcript"
    ],
    "summary": "How I use Claude Code to automate my entire life (5 tricks) URL: https://youtube.com/watch?v=wfiv67NixCY Segments: 402 Everyone knows Claude Code is the best coding tool in the world. But what if I told you it has a mill…",
    "content": "How I use Claude Code to automate my entire life (5 tricks)\nURL: https://youtube.com/watch?v=wfiv67NixCY\nSegments: 402\n\nEveryone knows Claude Code is the best\ncoding tool in the world. But what if I\ntold you it has a million use cases\noutside of coding that will make your\nlife significantly better? I use Claude\nCode to track my business metrics, to\ntrack my personal goals, to plan content\nfor me, to analyze all my notes and\nthoughts, and so much more. In this\nvideo, I'm going to show you how to do\nthe exact same thing. By the end of this\nvideo, you'll have every prompt you need\nto launch an army of AI agents from\nClaude Code that will be running your\nentire life. I'm Alex Finn and I use AI\nevery single day to build and launch\nbusinesses, including Creator Buddy,\nwhich is now a $300,000 a year AI\ncontent tool. Let's get into it.\nSo, I'm going to show you five use cases\nof how I use Claude Code to run my\nday-to-day life. But first, I'm going to\nshow you how to set this up yourself. In\norder for Claude Code to effectively do\nwork for you, it needs to know context\non who you are. So, open up Claude Code\ninside a cursor. Create a new folder in\nthere. I call mine clawed life. You can\ncall it life OS or whatever you want.\nAnd then create a new markdown file in\nthere called background on yourself. In\nthis markdown file, include as much\ninformation about yourself as you\npossibly can. Who you are, what your\ninterests are, links to your content,\nlinks to your side hustles, anything\nthat's relevant to who you are. This\nwill be the data that's sent to Claude\nwhen you run any of the use cases I'm\nabout to show you. For instance, when\nyou run your weekly check-ins, your\ndaily journal, your content researcher\nand planner, all of this data you put in\nthis file will be sent to claude to make\nit so much more powerful. Once you've\ncreated that file inside of claude code\nand cursor, all you need to do is is run\n/init in claude code. And what that'll\ndo is take that information and create a\ncla rules file that will set cla code up\nfor these use cases. So, let's get into\nthe first use case that is my weekly\ncheck-in. Claude Code automatically runs\na weekly check-in for me where it will\ntrack all my metrics on my business, my\npersonal life, my career, my side\nhustles, everything. And it creates this\nincredible personal dashboard that shows\nmy growth in all my metrics and\neverything I'm doing in my life. And\nit's all done through Claude Code. So,\nwhat I do is every single Sunday night,\nI run slashweekly\ncheck-in. And I'll show you how to set\nthis up right after. I hit enter. And\nnow a sub agent is spawned that I built\nthat will now collect a bunch of metrics\nfrom me and update that dashboard with\nall my latest information and metrics.\nSo what you can see here is it asks me\nfor all my latest metrics. I just type\nit in. It knows dynamically which\nmetrics are important to me based on the\ninformation I put in that file in that\nlast step. So I quickly filled in those\nmetrics it asked for. I hit enter. And\nnow what it's going to do is take those\nmetrics and update my personal weekly\ndashboard so I can track my growth over\ntime. So now sub agents are being spun\nup and they're going taking my data and\ncreating that really nice custom\ndashboard. And this was all done really\nintelligently, right? It went in, saw\nall the information about myself, saw\nthat I had a YouTube, a business, a\nTwitter, all of that. Figured out what\nmetrics would be important for me and\nthen built that dashboard. And just like\nthat, it's done. And this was all set up\nwith a single prompt, which I put down\nbelow in the description. So feel free\nto pause, take this if you want, or wait\ntill after. You grab that prompt, you\nput it into claw code after you did the\nsetup I showed you earlier, and it will\nactually build out the slash command\nthat launches the sub aents as well as\nbuild the sub aents itself that actually\nwent in and performed this task. What's\namazing is it actually gives you a lot\nof other recommendations as well. It\ntells you what content ideas you can\nbuild out based on what it knows about\nyou. It gives you wins of the week, the\nfact I hit 30,000 on YouTube, it\ncelebrates those wins. So, it gives you\na lot of other cool things in here and\ntells you when you can even run the next\ncheck-in. It's like having a personal AI\nagent that works for me. Again, prompt\nto set up this AI agent down below. You\ncan just feed that into Cloud Code and\nyou're good to go.\n[Music]\nThe next use case I do is really good\nfor my mental health. It is basically a\ndaily journaling AI agent that Claude\nCode runs. So, every morning I go into\nClaude Code and I'll do SL daily\ncheck-in. This is basically a daily\njournaling habit I do every single\nnight. And what this is going to do is\nit it's going to ask me for a bunch of\ninformation. It's going to put into a\npersonal dashboard. But this dashboard's\ndifferent. This dashboard's for habits.\nThis dashboard's for mental health. This\ndashboards for how I'm feeling and what\nI accomplish. It's basically an\nautomated journaling AI agent. So I'm\ngoing to run /aily check-in. This is\nbasically my journaling agent. I'm going\nto hit enter. And now it's going to ask\nme a few questions about my day-to-day\nlife. It will now store in my daily\njournaling dashboard. So, as you can\nsee, good evening, Alex. What did I\naccomplish today? How are you feeling\nright now? What are your biggest wins\ntoday? I answer these questions. I hit\nenter. It sends it to my AI agent and\nClaude Code, and that creates my daily\njournal entry. So, this is a great way\nto have Claude Code work with you, track\nthe things you're accomplishing in your\nlife, help you practice a little bit of\ngratitude, and just stay on top of your\nday-to-day progress. Again, all done\nwith a single prompt. I set that up and\nnow all I do every day is just type in\nslash daily check-in and I'm good to go.\nI put that prompt down below as well.\nFeel free to wait till the end if you\nwant to just copy and paste those\nprompts. You can do the step and just\npaste each one of those in individually\nand you're good to go.\n[Music]\nSo, as you obviously know, I am a\ncontent creator and I actually use\nClaude Code to help build all my\ncontent. I have a popular newsletter. It\nhas 40,000 subs. I actually use Claude\ncode to do research and all my competing\nnewsletters and also look at my recent\nnewsletters to see what does well based\non all that information. It actually\nwrites me my weekly draft for my\nnewsletters with one single command.\nWith one command, it's researching a ton\nof other newsletters. It's reading all\nmy newsletters and based on what's\ntrending, writes me a newsletter draft\nin my own voice. It doesn't have to just\nbe newsletters. If you do any sort of\ncontent creation at all, you can use\nClawed Code to research all your\ncompetitors and draft content in your\nown voice. The setup for this is simple.\nInside of Clawude Code, I just have a\nmarkdown file where I list my newsletter\nas well as other newsletters that are in\nmy niche. And then when I run the\ncommands I'm about to show you in a\nsecond, it does the research through all\nthose newsletters and writes me that\ndraft. So, all I do is type\nslashnewsletter\nresearcher,\nhit enter, and now the AI agent's not\nonly going to read all my competitors\nnewsletters, it's going to read my own\nnewsletters and then write a newsletter\ndraft in my own voice. So, I ran the\ncommand. It then read the newsletters\nfrom all my competitors, went through\ntheir entire content history to see what\ntrends were going on at the moment. It\nsaw what they were talking about. It\ntalked about AI tool adoption, rapid\nskill acquisition, pricing, and business\ngrowth. And then it found unique angles\nfor me based on the newsletters in my\nown newsletter, which is incredible. And\nthe way this can work for you is if\nyou're a YouTube creator, it can do\nsimilar things or researches competitor\nYouTubes. Or if you're a Twitter\ncreator, it'll look at other Twitter\naccounts. And so for me, this helps me\nwith my newsletter. I write my\nnewsletter every single Thursday. And I\njust quickly run that command every\nThursday. A few minutes later, I have a\ndraft I can go with. I edit the draft,\nhit send, and it's good to go. Claude\nCode has been the best content\nresearcher I've ever had in my life.\nWith one command, I will never run out\nof newsletter ideas again. Again, if you\nwant to set up your own content\nresearcher prompt down below, you can\njust copy and paste this. Those are\nreally cool use cases. My next one might\nbe the most powerful one yet.\n[Music]\nThis next use case I call a brain dump\nanalyzer, but basically what it is is a\nnote analyzing tool. I have a folder in\nmy clawed folder here that has a bunch\nof brain dumps I that I do as often as I\npossibly can. In these brain dumps, I\njust talk about anything going on in my\nlife, any observations I have, any\ninterests I have, just things that are\ngoing on in my head. Then what I do "
  }
]